KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
/*
 * Copyright (c) 2020 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <stdlib.h>
#include "local_config.h"
#include "radio_node.h"
#include <errno.h>
#include <zephyr/init.h>
#include <zephyr/kernel.h>
#include <zephyr/random/random.h>
#include <zephyr/shell/shell.h>
#include <zephyr/types.h>
#include <zephyr/drivers/hwinfo.h>
#include <zephyr/settings/settings.h>
#if !defined(CONFIG_SOC_SERIES_NRF54HX)
#include <hal/nrf_power.h>
#endif /* !defined(CONFIG_SOC_SERIES_NRF54HX) */

#if CONFIG_FEM
#include "fem_al/fem_al.h"
#endif /* CONFIG_FEM */

#include "radio_test.h"

#if NRF_POWER_HAS_DCDCEN_VDDH
	#define TOGGLE_DCDC_HELP			\
	"Toggle DCDC state <state>, "			\
	"if state = 1 then toggle DC/DC state, or "	\
	"if state = 0 then toggle DC/DC VDDH state"
#elif NRF_POWER_HAS_DCDCEN
	#define TOGGLE_DCDC_HELP			\
	"Toggle DCDC state <state>, "			\
	"Toggle DC/DC state regardless of state value"
#endif


/* Radio parameter configuration. */
static struct radio_param_config {
	/** Radio transmission pattern. */
	enum transmit_pattern tx_pattern;

	/** Radio mode. Data rate and modulation. */
	nrf_radio_mode_t mode;

	/** Radio output power. */
	int8_t txpower;

	/** Radio start channel (frequency). */
	uint8_t channel_start;

	/** Radio end channel (frequency). */
	uint8_t channel_end;

	/** Delay time in milliseconds. */
	uint32_t delay_ms;

	/** Duty cycle. */
	uint32_t duty_cycle;

	/**
	 * Number of packets to be received.
	 * Set to zero for continuous RX.
	 */
	uint32_t rx_packets_num;

#if CONFIG_FEM
	/* Front-end module (FEM) configuration. */
	struct radio_test_fem fem;
#endif /* CONFIG_FEM */
} config = {
	.tx_pattern = TRANSMIT_PATTERN_RANDOM,
	.mode = NRF_RADIO_MODE_IEEE802154_250KBIT,
	.txpower = 8,
	.channel_start = 17,
	.channel_end = 17,
	.delay_ms = 10,
	.duty_cycle = 50,
#if CONFIG_FEM
	.fem.tx_power_control = FEM_USE_DEFAULT_TX_POWER_CONTROL
#endif /* CONFIG_FEM */
};

static struct radio_param_config default_config = {
	.tx_pattern = TRANSMIT_PATTERN_RANDOM,
	.mode = NRF_RADIO_MODE_IEEE802154_250KBIT,
	.txpower = 8,
	.channel_start = 17,
	.channel_end = 17,
	.delay_ms = 10,
	.duty_cycle = 50,
#if CONFIG_FEM
	.fem.tx_power_control = FEM_USE_DEFAULT_TX_POWER_CONTROL
#endif /* CONFIG_FEM */
};

static void set_config_txpower(int8_t txpower)
{
	config.txpower = txpower;
	radio_proto_set_response_txpower(config.txpower);
}

/* Radio test configuration. */
static struct radio_test_config test_config;

struct radio_proto_cli_config {
	uint32_t signature;
	enum radio_proto_role role;
	uint32_t discover_window_ms;
	uint32_t per_wait_ms;
	uint32_t provision_wait_ms;
	uint32_t test_packets;
};

static struct radio_proto_cli_config proto_cfg = {
	.signature = 0,
	.role = RADIO_PROTO_ROLE_DISABLED,
	.discover_window_ms = 250,
	.per_wait_ms = 80,
	.provision_wait_ms = 500,
	.test_packets = 100,
};

#define RADIO_NODE_SETTINGS_NAME "radio_node"
#define RADIO_NODE_SETTINGS_KEY  RADIO_NODE_SETTINGS_NAME "/state"
#define RADIO_NODE_SETTINGS_MAGIC 0x4E4F4445u
#define RADIO_NODE_SETTINGS_VERSION 2u

struct radio_node_persist {
	uint32_t magic;
	uint16_t version;
	uint16_t mode;
	uint32_t assigned_signature;
	uint32_t next_receiver_id;
	uint8_t node_type;
	uint8_t is_data_aggregator;
	uint16_t reserved0;
};

static struct radio_node_persist node_cfg = {
	.magic = RADIO_NODE_SETTINGS_MAGIC,
	.version = RADIO_NODE_SETTINGS_VERSION,
	.mode = RADIO_NODE_MODE_UNASSIGNED,
	.assigned_signature = 0u,
	.next_receiver_id = 1u,
	.node_type = RADIO_SURVEY_NODE_TYPE_X,
	.is_data_aggregator = 0u,
	.reserved0 = 0u,
};

static uint32_t node_hw_signature;
static uint32_t node_pending_assigned_signature;
static uint32_t node_pending_discover_rsp_dst;
static uint8_t node_pending_channel_apply;
static bool node_pending_channel_apply_valid;
static bool node_settings_loaded;
static bool node_rx_ready;
static volatile bool proto_release_cancel;
static volatile bool proto_remote_test_cancel;
static struct k_work node_button_work;
static struct k_work node_apply_receiver_work;
static struct k_work_delayable remote_test_work;
static struct k_work_delayable node_release_work;
static struct k_work_delayable node_settings_save_work;
static volatile bool proto_collect_per_cancel;
static volatile bool rssi_monitor_cancel;
static volatile bool rssi_monitor_active;
static uint32_t rssi_monitor_interval_ms = 250u;



static void rssi_monitor_work_handler(struct k_work *work);
K_WORK_DELAYABLE_DEFINE(rssi_monitor_work, rssi_monitor_work_handler);

#define NODE_RELEASE_APPLY_DELAY_MS 200
#define NODE_SETTINGS_SAVE_DELAY_MS 300
#define RSSI_MONITOR_INTERVAL_MIN_MS 1u
#define REMOTE_TEST_REPORT_RETRY_MAX 40
#define REMOTE_TEST_DONE_RETRY_MAX 40
#define REMOTE_TEST_DELEGATE_TIMEOUT_MIN_MS 4000u
#define PRETEST_CLEAR_RETRY_MAX 40u
#define REMOTE_TEST_REQ_RETRY_MAX 40u
#define REMOTE_TEST_REQ_ACK_WAIT_MIN_MS 120u
#define REMOTE_TEST_WORK_START_DELAY_MS 70u
#define REMOTE_TEST_DONE_DRAIN_MIN_MS 300u
#define REMOTE_TEST_DISCOVER_ROUNDS 2u
#define PROTO_PER_PHASE_MAX_ROUNDS 40u
#define CONTROL_ACK_RETRY_MAX 40u
#define CONTROL_ACK_WAIT_MIN_MS 300u
#define TEST_START_SETTLE_MS 60u
#define SHARED_TEST_LIST_MAX (RADIO_PROTO_MAX_PEERS + 1u)

#define REMOTE_TEST_WORKQ_STACK_SIZE 8192
K_THREAD_STACK_DEFINE(remote_test_workq_stack, REMOTE_TEST_WORKQ_STACK_SIZE);
static struct k_work_q remote_test_workq;

struct remote_test_request_state {
	uint32_t controller_signature;
	uint16_t packets;
	uint16_t wait_ms;
	uint16_t retry_ms;
	bool pending;
	bool busy;
};

struct remote_test_monitor_state {
	volatile bool active;
	volatile bool req_acked;
	volatile bool done;
	volatile uint32_t delegate_signature;
	volatile uint16_t expected_packets;
	volatile uint16_t reported_peers;
	volatile uint32_t last_activity_ticks;
	uint32_t reported_peer_sigs[RADIO_PROTO_MAX_PEERS];
	uint8_t reported_peer_count;
};

static struct remote_test_request_state remote_test_request;
static struct remote_test_monitor_state remote_test_monitor;
static volatile bool remote_test_req_ack_received;
static volatile uint16_t remote_test_req_ack_packets;
static volatile bool remote_test_report_ack_received;
static volatile uint32_t remote_test_report_ack_peer;
static volatile uint16_t remote_test_report_ack_value;
static volatile bool remote_test_done_ack_received;
static volatile uint16_t remote_test_done_ack_reports;
static uint32_t shared_test_node_sigs[SHARED_TEST_LIST_MAX];
static uint8_t shared_test_node_count;
static volatile bool control_ack_received;
static volatile uint32_t control_ack_sender;
static volatile uint16_t control_ack_cmd;
static volatile uint32_t control_ack_context;


void radio_node_note_proto_frame_activity(uint32_t src_signature)
{
	if (!remote_test_monitor.active) {
		return;
	}

	if (src_signature != remote_test_monitor.delegate_signature) {
		return;
	}

	remote_test_monitor.last_activity_ticks = (uint32_t)k_uptime_get_32();
}

