KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
static void shared_test_list_clear_local(void)
{
	shared_test_node_count = 0u;
	memset(shared_test_node_sigs, 0, sizeof(shared_test_node_sigs));
}

static bool shared_test_list_add_local(uint32_t signature)
{
	if (signature == 0u) {
		return false;
	}

	for (uint8_t i = 0; i < shared_test_node_count; i++) {
		if (shared_test_node_sigs[i] == signature) {
			return true;
		}
	}

	if (shared_test_node_count >= ARRAY_SIZE(shared_test_node_sigs)) {
		return false;
	}

	shared_test_node_sigs[shared_test_node_count++] = signature;
	return true;
}

static uint8_t shared_test_list_copy(uint32_t *signatures, uint8_t max_count)
{
	uint8_t count = MIN(max_count, shared_test_node_count);

	for (uint8_t i = 0; i < count; i++) {
		signatures[i] = shared_test_node_sigs[i];
	}

	return count;
}

static uint32_t proto_find_discovered_aggregator_signature(void)
{
	struct radio_proto_status status;

	radio_proto_get_status(&status);

	for (uint8_t i = 0; i < status.peer_count; i++) {
		if (status.peers[i].signature != 0u && status.peers[i].is_data_aggregator) {
			return status.peers[i].signature;
		}
	}

	return 0u;
}

static void proto_control_ack_reset(void)
{
	control_ack_received = false;
	control_ack_sender = 0u;
	control_ack_cmd = 0u;
	control_ack_context = 0u;
}


static bool proto_minimal_logging = true;

static K_SEM_DEFINE(proto_tx_done_sem, 0, 1);

/* If true, RX sweep, TX sweep or duty cycle test is performed. */
static bool test_in_progress;

static uint32_t node_hash_bytes(const uint8_t *buf, size_t len)
{
	uint32_t hash = 2166136261u;

	for (size_t i = 0; i < len; i++) {
		hash ^= buf[i];
		hash *= 16777619u;
	}

	if (hash == 0u || hash == RADIO_PROTO_BROADCAST_SIG) {
		hash ^= 0x13579BDFu;
	}

	return hash;
}

static uint32_t node_read_hardware_signature(void)
{
	uint8_t device_id[16];
	ssize_t len;

	len = hwinfo_get_device_id(device_id, sizeof(device_id));
	if (len <= 0) {
		uint32_t fallback = sys_rand32_get();

		if (fallback == 0u || fallback == RADIO_PROTO_BROADCAST_SIG) {
			fallback = 1u;
		}

		printk("Failed to read hardware ID, using fallback signature 0x%08x\n", fallback);
		return fallback;
	}

	return node_hash_bytes(device_id, (size_t)len);
}

static bool proto_require_ieee_mode_internal(void)
{
	return config.mode == NRF_RADIO_MODE_IEEE802154_250KBIT;
}

static int node_settings_set(const char *name, size_t len_rd,
			     settings_read_cb read_cb, void *cb_arg)
{
	if (strcmp(name, "state") != 0) {
		return -ENOENT;
	}

	if (len_rd != sizeof(node_cfg)) {
		return -EINVAL;
	}

	if (read_cb(cb_arg, &node_cfg, sizeof(node_cfg)) != sizeof(node_cfg)) {
		return -EIO;
	}

	node_settings_loaded = true;
	return 0;
}

SETTINGS_STATIC_HANDLER_DEFINE(radio_node, RADIO_NODE_SETTINGS_NAME, NULL,
			       node_settings_set, NULL, NULL);

static int node_settings_save_now(void)
{
	int err;

	err = settings_save_one(RADIO_NODE_SETTINGS_KEY, &node_cfg, sizeof(node_cfg));
	if (err != 0) {
		printk("Failed to save node settings: %d\n", err);
	}

	return err;
}

static void node_settings_save_work_handler(struct k_work *work)
{
	ARG_UNUSED(work);
	(void)node_settings_save_now();
}

static void node_stop_radio_activity(void)
{
	radio_test_cancel(test_config.type);
	k_msleep(5);
}

static void proto_start_rx_continuous(void);
static void proto_rx_window(uint32_t window_ms);
static void node_apply_mode(enum radio_node_mode mode);
static void remote_test_work_handler(struct k_work *work);
static void proto_clear_counters_before_test(const struct shell *shell,
					      uint32_t wait_ms,
					      uint32_t retry_ms);
static int proto_collect_per_run(const struct shell *shell, uint32_t expected,
				 uint32_t wait_ms, uint32_t retry_ms);
static int proto_round_robin_run_internal(const struct shell *shell, uint32_t packets,
					   uint32_t wait_ms, uint32_t retry_ms);
static const char *node_mode_str(enum radio_node_mode mode);

static bool node_is_type_valid(uint8_t node_type)
{
	return node_type == RADIO_SURVEY_NODE_TYPE_X ||
	       node_type == RADIO_SURVEY_NODE_TYPE_Y;
}

static const char *node_type_str(uint8_t node_type)
{
	switch (node_type) {
	case RADIO_SURVEY_NODE_TYPE_X:
		return "x";
	case RADIO_SURVEY_NODE_TYPE_Y:
		return "y";
	default:
		return "unknown";
	}
}

static bool node_peer_eligible_for_per(const struct radio_proto_peer *peer)
{
	return peer != NULL && peer->signature != 0u;
}

static void node_apply_local_profile_to_proto(void)
{
	radio_proto_set_local_node_profile((enum radio_survey_node_type)node_cfg.node_type,
					  node_cfg.is_data_aggregator != 0u);
}

static void proto_ack_start(const struct shell *shell, const char *command)
{
	if (shell != NULL) {
		shell_print(shell, "ACK_START,%s", command);
	} else {
		printk("ACK_START,%s\n", command);
	}
}

static void proto_ack_end(const struct shell *shell, const char *command, int err)
{
	if (shell != NULL) {
		shell_print(shell, "ACK_END,%s,%s", command, (err == 0) ? "OK" : "ERR");
	} else {
		printk("ACK_END,%s,%s\n", command, (err == 0) ? "OK" : "ERR");
	}
}

static void proto_emit_per_report(uint32_t rx_signature, uint32_t tx_signature,
				  uint16_t sent_packets, uint16_t recv_packets)
{
	/* PER_REPORT,<tx_serial>,<rx_serial>,<total_sent>,<total_received> */
	printk("PER_REPORT,0x%08x,0x%08x,%u,%u\n",
	       tx_signature,
	       rx_signature,
	       (unsigned int)sent_packets,
	       (unsigned int)recv_packets);
}

static void proto_emit_per_timeout(uint32_t rx_signature, uint32_t tx_signature,
				   uint16_t sent_packets)
{
	/* PER_REPORT_TIMEOUT,<tx_serial>,<rx_serial>,<total_sent> */
	printk("PER_REPORT_TIMEOUT,0x%08x,0x%08x,%u\n",
	       tx_signature,
	       rx_signature,
	       (unsigned int)sent_packets);
}

static bool proto_verbose_logging_enabled(void)
{
	return !proto_minimal_logging;
}

static bool remote_test_monitor_mark_peer_reported(uint32_t peer_signature)
{
	for (uint8_t i = 0; i < remote_test_monitor.reported_peer_count; i++) {
		if (remote_test_monitor.reported_peer_sigs[i] == peer_signature) {
			return false;
		}
	}

	if (remote_test_monitor.reported_peer_count < ARRAY_SIZE(remote_test_monitor.reported_peer_sigs)) {
		remote_test_monitor.reported_peer_sigs[remote_test_monitor.reported_peer_count++] = peer_signature;
	}

