KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	return true;
}

static bool remote_test_monitor_has_peer_report(uint32_t peer_signature)
{
	for (uint8_t i = 0; i < remote_test_monitor.reported_peer_count; i++) {
		if (remote_test_monitor.reported_peer_sigs[i] == peer_signature) {
			return true;
		}
	}

	return false;
}

static void node_release_work_handler(struct k_work *work)
{
	ARG_UNUSED(work);

	node_cfg.assigned_signature = 0u;
	node_pending_assigned_signature = 0u;
	node_pending_discover_rsp_dst = 0u;
	radio_proto_reset();
	node_apply_mode(RADIO_NODE_MODE_UNASSIGNED);
	k_work_reschedule(&node_settings_save_work, K_NO_WAIT);
	if (proto_verbose_logging_enabled()) {
		printk("Released to unassigned state by coordinator\n");
	}
}

static uint32_t proto_pack_u16_pair(uint16_t low, uint16_t high)
{
	return (uint32_t)low | ((uint32_t)high << 16);
}

static uint16_t proto_unpack_u16_low(uint32_t packed)
{
	return (uint16_t)(packed & 0xFFFFu);
}

static uint16_t proto_unpack_u16_high(uint32_t packed)
{
	return (uint16_t)(packed >> 16);
}

static void node_apply_mode(enum radio_node_mode mode)
{
	node_cfg.mode = (uint16_t)mode;
	node_rx_ready = (mode == RADIO_NODE_MODE_RECEIVER);

	if (mode == RADIO_NODE_MODE_RECEIVER && node_cfg.assigned_signature != 0u) {
		proto_cfg.signature = node_cfg.assigned_signature;
	} else {
		proto_cfg.signature = node_hw_signature;
	}

	radio_proto_set_signature(proto_cfg.signature);
	node_apply_local_profile_to_proto();
	node_stop_radio_activity();

	switch (mode) {
	case RADIO_NODE_MODE_COORDINATOR:
		proto_cfg.role = RADIO_PROTO_ROLE_RX;
		radio_proto_set_role(RADIO_PROTO_ROLE_RX);
		proto_start_rx_continuous();
		break;
	case RADIO_NODE_MODE_RECEIVER:
		proto_cfg.role = RADIO_PROTO_ROLE_RX;
		radio_proto_set_role(RADIO_PROTO_ROLE_RX);
		proto_start_rx_continuous();
		break;
	case RADIO_NODE_MODE_TEST_TX:
		proto_cfg.role = RADIO_PROTO_ROLE_TX;
		radio_proto_set_role(RADIO_PROTO_ROLE_TX);
		break;
	case RADIO_NODE_MODE_UNASSIGNED:
	default:
		proto_cfg.role = RADIO_PROTO_ROLE_DISABLED;
		radio_proto_set_role(RADIO_PROTO_ROLE_DISABLED);
		proto_start_rx_continuous();
		break;
	}
}

void radio_node_handle_proto_response_complete(enum radio_proto_cmd cmd,
					       uint32_t dst_signature,
					       uint16_t value,
					       uint32_t aux_signature)
{
	ARG_UNUSED(dst_signature);
	ARG_UNUSED(aux_signature);

	if (!node_pending_channel_apply_valid) {
		return;
	}

	if (cmd != RADIO_PROTO_CMD_CONTROL_ACK ||
	    value != RADIO_PROTO_CMD_SET_CHANNEL) {
		return;
	}

	config.channel_start = node_pending_channel_apply;
	config.channel_end = node_pending_channel_apply;
	node_pending_channel_apply_valid = false;
	node_apply_mode((enum radio_node_mode)node_cfg.mode);
}

static void node_apply_receiver_work_handler(struct k_work *work)
{
	ARG_UNUSED(work);

	if (node_pending_assigned_signature == 0u) {
		return;
	}

	node_cfg.assigned_signature = node_pending_assigned_signature;
	node_pending_assigned_signature = 0u;
	node_apply_mode(RADIO_NODE_MODE_RECEIVER);

	if (node_pending_discover_rsp_dst != 0u) {
		radio_proto_schedule_response(RADIO_PROTO_CMD_DISCOVER_RSP,
					     node_pending_discover_rsp_dst,
					     0u);
		node_pending_discover_rsp_dst = 0u;
	}

	/* Keep first DISCOVER_RSP prompt; defer flash write to avoid delaying response work. */
	k_work_reschedule(&node_settings_save_work, K_MSEC(NODE_SETTINGS_SAVE_DELAY_MS));
	printk("Provisioned as receiver ID 0x%08x\n", node_cfg.assigned_signature);
}

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
static void ieee_channel_check(const struct shell *shell, uint8_t channel)
{
	if (config.mode == NRF_RADIO_MODE_IEEE802154_250KBIT) {
		if ((channel < IEEE_MIN_CHANNEL) ||
		    (channel > IEEE_MAX_CHANNEL)) {
			shell_print(shell,
				"For %s config.mode channel must be between %d and %d",
				STRINGIFY(NRF_RADIO_MODE_IEEE802154_250KBIT),
				IEEE_MIN_CHANNEL,
				IEEE_MAX_CHANNEL);

			shell_print(shell, "Channel set to %d",
				    IEEE_MIN_CHANNEL);
		}

	}
}
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

static int cmd_start_channel_set(const struct shell *shell, size_t argc,
				 char **argv)
{
	uint32_t channel;
	enum radio_node_mode mode = (enum radio_node_mode)node_cfg.mode;

	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count", argv[0]);
		return -EINVAL;
	}

	channel = atoi(argv[1]);

	if (channel > 80) {
		shell_error(shell, "Channel must be between 0 and 80");
		return -EINVAL;
	}

	if (config.mode == NRF_RADIO_MODE_IEEE802154_250KBIT &&
	    (channel < IEEE_MIN_CHANNEL || channel > IEEE_MAX_CHANNEL)) {
		shell_error(shell,
			    "For ieee802154_250Kbit, channel must be between %d and %d",
			    IEEE_MIN_CHANNEL,
			    IEEE_MAX_CHANNEL);
		return -EINVAL;
	}

	config.channel_start = (uint8_t) channel;

	/* Reapply current mode so active RX is retuned immediately. */
	if (mode == RADIO_NODE_MODE_COORDINATOR ||
	    mode == RADIO_NODE_MODE_RECEIVER ||
	    mode == RADIO_NODE_MODE_UNASSIGNED) {
		node_apply_mode(mode);
		shell_print(shell, "Start channel set to: %d (RX retuned)", channel);
	} else {
		shell_print(shell, "Start channel set to: %d", channel);
	}
	return 0;
}

static int cmd_end_channel_set(const struct shell *shell, size_t argc,
			       char **argv)
{
	uint32_t channel;

	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count", argv[0]);
		return -EINVAL;
	}

	channel = atoi(argv[1]);

	if (channel > 80) {
		shell_error(shell, "Channel must be between 0 and 80");
		return -EINVAL;
	}

	if (config.mode == NRF_RADIO_MODE_IEEE802154_250KBIT &&
	    (channel < IEEE_MIN_CHANNEL || channel > IEEE_MAX_CHANNEL)) {
		shell_error(shell,
			    "For ieee802154_250Kbit, channel must be between %d and %d",
			    IEEE_MIN_CHANNEL,
			    IEEE_MAX_CHANNEL);
		return -EINVAL;
	}

	config.channel_end = (uint8_t) channel;

	shell_print(shell, "End channel set to: %d", channel);
	return 0;
}

static int cmd_time_set(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t time;

	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count", argv[0]);
		return -EINVAL;
	}

