KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	time = atoi(argv[1]);

	if (time > 99) {
		shell_error(shell, "Delay time must be between 0 and 99 ms");
		return -EINVAL;
	}

	config.delay_ms = time;

	shell_print(shell, "Delay time set to: %d", time);
	return 0;
}

static void rssi_monitor_work_handler(struct k_work *work)
{
	int16_t rssi_dbm;

	ARG_UNUSED(work);

	if (!rssi_monitor_active || rssi_monitor_cancel) {
		return;
	}

	if (radio_test_sample_rssi_dbm(&rssi_dbm)) {
		printk("ROOM_RSSI,%d dBm\n", rssi_dbm);
	} else {
		printk("ROOM_RSSI,NA\n");
	}

	k_work_reschedule(&rssi_monitor_work, K_MSEC(rssi_monitor_interval_ms));
}

static int cmd_cancel(const struct shell *shell, size_t argc, char **argv)
{
	proto_collect_per_cancel = true;
	proto_release_cancel = true;
	proto_remote_test_cancel = true;
	rssi_monitor_cancel = true;
	rssi_monitor_active = false;
	k_work_cancel_delayable(&rssi_monitor_work);
	radio_test_cancel(test_config.type);
	test_in_progress = false;
	return 0;
}

static int cmd_rssi_monitor(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t interval_ms = rssi_monitor_interval_ms;

	if (argc > 2) {
		shell_error(shell, "Usage: rssi_monitor [interval_ms|stop]");
		return -EINVAL;
	}

	if (argc == 2 && strcmp(argv[1], "stop") == 0) {
		rssi_monitor_cancel = true;
		rssi_monitor_active = false;
		k_work_cancel_delayable(&rssi_monitor_work);
		radio_test_cancel(test_config.type);
		test_in_progress = false;
		shell_print(shell, "RSSI monitor stopped");
		return 0;
	}

	if (argc == 2) {
		interval_ms = strtoul(argv[1], NULL, 0);
		if (interval_ms < RSSI_MONITOR_INTERVAL_MIN_MS) {
			shell_error(shell, "interval_ms must be >= %u", RSSI_MONITOR_INTERVAL_MIN_MS);
			return -EINVAL;
		}
	}

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	ieee_channel_check(shell, config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	if (test_in_progress) {
		radio_test_cancel(test_config.type);
		test_in_progress = false;
	}

	memset(&test_config, 0, sizeof(test_config));
	test_config.type = RX;
	test_config.mode = config.mode;
	test_config.params.rx.channel = config.channel_start;
	test_config.params.rx.pattern = TRANSMIT_PATTERN_RANDOM;
	test_config.params.rx.packets_num = 0;
#if CONFIG_FEM
	test_config.fem = config.fem;
#endif /* CONFIG_FEM */

	radio_test_start(&test_config);
	test_in_progress = true;

	rssi_monitor_interval_ms = interval_ms;
	rssi_monitor_cancel = false;
	rssi_monitor_active = true;
	k_work_reschedule(&rssi_monitor_work, K_NO_WAIT);

	shell_print(shell,
		   "RSSI monitor started on channel %u, interval %u ms (use 'cancel' or 'rssi_monitor stop')",
		   config.channel_start,
		   interval_ms);
	return 0;
}

static int cmd_data_rate_set(const struct shell *shell, size_t argc,
			     char **argv)
{
	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count", argv[0]);
		return -EINVAL;
	}

	if (argc == 2) {
		shell_error(shell, "Unknown argument: %s", argv[1]);
		return -EINVAL;
	}

	return 0;
}

static int cmd_tx_carrier_start(const struct shell *shell, size_t argc,
				char **argv)
{
	if (test_in_progress) {
		radio_test_cancel(test_config.type);
		test_in_progress = false;
	}

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	ieee_channel_check(shell, config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	memset(&test_config, 0, sizeof(test_config));
	test_config.type = UNMODULATED_TX;
	test_config.mode = config.mode;
	test_config.params.unmodulated_tx.txpower = config.txpower;
	test_config.params.unmodulated_tx.channel = config.channel_start;
#if CONFIG_FEM
	test_config.fem = config.fem;
#endif /* CONFIG_FEM */
	radio_test_start(&test_config);

	shell_print(shell, "Start the TX carrier");
	return 0;
}

static void tx_modulated_carrier_end(void)
{
	printk("The modulated TX has finished\n");
}

static void rx_end(void)
{
	uint32_t recv_pkt, req_pkt;
	float error_rate;

	struct radio_rx_stats rx_stats;

	memset(&rx_stats, 0, sizeof(rx_stats));

	radio_rx_stats_get(&rx_stats);

	recv_pkt = rx_stats.packet_cnt;
	req_pkt = config.rx_packets_num;

	if (req_pkt == 0 || req_pkt < recv_pkt) {
		printk("Error receiving packets\n");
		return;
	}

	error_rate = ((float)(req_pkt - recv_pkt) / req_pkt) * 100.0f;

	printk("\n");
	printk("Received number of packets: %d\n", recv_pkt);
	printk("Required number of packages: %d\n", req_pkt);
	printk("Error rate: %.2f%%\n", (double)error_rate);

	if (error_rate >= 10) {
		printk("\033[91mWarning: High error rate! \033[0m\n");
	}
}

static int cmd_tx_modulated_carrier_start(const struct shell *shell,
					  size_t argc,
					  char **argv)
{
	if (test_in_progress) {
		radio_test_cancel(test_config.type);
		test_in_progress = false;
	}

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	ieee_channel_check(shell, config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count.", argv[0]);
		return -EINVAL;
	}

	memset(&test_config, 0, sizeof(test_config));
	test_config.mode = config.mode;
	test_config.type = MODULATED_TX_DUTY_CYCLE;
	test_config.params.modulated_tx_duty_cycle.txpower = config.txpower;
	test_config.params.modulated_tx_duty_cycle.channel = config.channel_start;
	test_config.params.modulated_tx_duty_cycle.pattern = config.tx_pattern;
	test_config.params.modulated_tx_duty_cycle.duty_cycle = config.duty_cycle;
#if CONFIG_FEM
	test_config.fem = config.fem;
#endif /* CONFIG_FEM */

	if (argc == 2) {
		test_config.params.modulated_tx_duty_cycle.packets_num = atoi(argv[1]);
		test_config.params.modulated_tx_duty_cycle.cb = tx_modulated_carrier_end;
	}

	radio_test_start(&test_config);

	shell_print(shell, "Start the modulated TX carrier");
	return 0;
}

static int cmd_duty_cycle_set(const struct shell *shell, size_t argc,
			      char **argv)
{
	uint32_t duty_cycle;

	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count.", argv[0]);
		return -EINVAL;
	}

	duty_cycle = atoi(argv[1]);

	if (duty_cycle > 90) {
		shell_error(shell, "Duty cycle must be between 1 and 90.");
		return -EINVAL;
	}

	config.duty_cycle = duty_cycle;

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	ieee_channel_check(shell, config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	memset(&test_config, 0, sizeof(test_config));
	test_config.type = MODULATED_TX_DUTY_CYCLE;
	test_config.mode = config.mode;
	test_config.params.modulated_tx_duty_cycle.txpower = config.txpower;
	test_config.params.modulated_tx_duty_cycle.pattern = config.tx_pattern;
	test_config.params.modulated_tx_duty_cycle.channel =
		config.channel_start;
	test_config.params.modulated_tx_duty_cycle.duty_cycle =
		config.duty_cycle;
#if CONFIG_FEM
	test_config.fem = config.fem;
#endif /* CONFIG_FEM */

	radio_test_start(&test_config);
	test_in_progress = true;

