KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
static int cmd_rx_start(const struct shell *shell, size_t argc, char **argv)
{
	if (test_in_progress) {
		radio_test_cancel(test_config.type);
		test_in_progress = false;
	}

	if (argc > 2) {
		shell_error(shell, "%s: too many arguments", argv[0]);
		return -EINVAL;
	}

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	ieee_channel_check(shell, config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	memset(&test_config, 0, sizeof(test_config));
	test_config.type = RX;
	test_config.mode = config.mode;
	test_config.params.rx.channel = config.channel_start;
	test_config.params.rx.pattern = config.tx_pattern;
#if CONFIG_FEM
	test_config.fem = config.fem;
#endif /* CONFIG_FEM */

	if (argc == 2) {
		config.rx_packets_num = atoi(argv[1]);
		test_config.params.rx.packets_num = config.rx_packets_num;
		test_config.params.rx.cb = rx_end;

		if (config.rx_packets_num == 0) {
			shell_error(shell,
				   "The number of packets to receive must be greater than zero.");
			return -EINVAL;
		}
	}

	radio_test_start(&test_config);

	return 0;
}

#if defined(RADIO_TXPOWER_TXPOWER_Pos10dBm)
static void cmd_pos10dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(10));
	shell_print(shell, "TX power: %d", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos10dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos9dBm)
static void cmd_pos9dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(9));
	shell_print(shell, "TX power: %d", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos9dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos8dBm)
static void cmd_pos8dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(8));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos8dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos7dBm)
static void cmd_pos7dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(7));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos7dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos6dBm)
static void cmd_pos6dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(6));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos6dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos5dBm)
static void cmd_pos5dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(5));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos5dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos4dBm)
static void cmd_pos4dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(4));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos4dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos3dBm)
static void cmd_pos3dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(3));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos3dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos2dBm)
static void cmd_pos2dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(2));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos2dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos1dBm)
static void cmd_pos1dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(1));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos1dBm) */

static void cmd_pos0dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(0));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg1dBm)
static void cmd_neg1dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-1));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg1dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg2dBm)
static void cmd_neg2dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-2));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg2dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg3dBm)
static void cmd_neg3dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-3));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg3dBm) */

static void cmd_neg4dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-4));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg5dBm)
static void cmd_neg5dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-5));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg5dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg6dBm)
static void cmd_neg6dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-6));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg6dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg7dBm)
static void cmd_neg7dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-7));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg7dBm) */

static void cmd_neg8dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-8));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg9dBm)
static void cmd_neg9dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-9));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg9dBm) */

