KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
#if defined(RADIO_TXPOWER_TXPOWER_Neg10dBm)
static void cmd_neg10dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-10));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg10dBm) */

static void cmd_neg12dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-12));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg14dBm)
static void cmd_neg14dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-14));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg14dBm) */

static void cmd_neg16dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-16));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg18dBm)
static void cmd_neg18dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-18));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg18dBm) */

static void cmd_neg20dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-20));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg22dBm)
static void cmd_neg22dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-22));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg22dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg28dBm)
static void cmd_neg28dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-28));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg28dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg30dBm)
static void cmd_neg30dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-30));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg30dBm) */

static void cmd_neg40dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-40));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg46dBm)
static void cmd_neg46dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-46));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg46dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg70dBm)
static void cmd_neg70dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-70));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg70dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg100dBm)
static void cmd_neg100dbm(const struct shell *shell, size_t argc, char **argv)
{
	set_config_txpower((int8_t)(-100));
	shell_print(shell, "TX power : %d dBm", config.txpower);
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg100dBm) */

static int cmd_nrf_1mbit(const struct shell *shell, size_t argc, char **argv)
{
	config.mode = NRF_RADIO_MODE_NRF_1MBIT;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_NRF_1MBIT));

	return 0;
}

static int cmd_nrf_2mbit(const struct shell *shell, size_t argc, char **argv)
{
	config.mode = NRF_RADIO_MODE_NRF_2MBIT;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_NRF_2MBIT));

	return 0;
}

#if defined(RADIO_MODE_MODE_Nrf_250Kbit)
static int cmd_nrf_250kbit(const struct shell *shell, size_t argc,
			   char **argv)
{
	config.mode = NRF_RADIO_MODE_NRF_250KBIT;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_NRF_250KBIT));

	return 0;
}
#endif /* defined(RADIO_MODE_MODE_Nrf_250Kbit) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_5)
static int cmd_nrf_4mbit_h_0_5(const struct shell *shell, size_t argc,
			       char **argv)
{
	config.mode = NRF_RADIO_MODE_NRF_4MBIT_H_0_5;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_NRF_4MBIT_H_0_5));

	return 0;
}
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_5) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_25)
static int cmd_nrf_4mbit_h_0_25(const struct shell *shell, size_t argc,
				char **argv)
{
	config.mode = NRF_RADIO_MODE_NRF_4MBIT_H_0_25;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_NRF_4MBIT_H_0_25));

	return 0;
}
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_25) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT6)
static int cmd_nrf_4mbit_bt_0_6(const struct shell *shell, size_t argc,
				char **argv)
{
	config.mode = NRF_RADIO_MODE_NRF_4MBIT_BT_0_6;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_NRF_4MBIT_BT_0_6));

	return 0;
}
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT6) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT4)
static int cmd_nrf_4mbit_bt_0_4(const struct shell *shell, size_t argc,
				char **argv)
{
	config.mode = NRF_RADIO_MODE_NRF_4MBIT_BT_0_4;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_NRF_4MBIT_BT_0_4));

	return 0;
}
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT4) */

static int cmd_ble_1mbit(const struct shell *shell, size_t argc, char **argv)
{
	config.mode = NRF_RADIO_MODE_BLE_1MBIT;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_BLE_1MBIT));

	return 0;
}

static int cmd_ble_2mbit(const struct shell *shell, size_t argc, char **argv)
{
	config.mode = NRF_RADIO_MODE_BLE_2MBIT;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_BLE_2MBIT));

	return 0;
}

#if CONFIG_HAS_HW_NRF_RADIO_BLE_CODED
static int cmd_ble_lr125kbit(const struct shell *shell, size_t argc,
			     char **argv)
{
	config.mode = NRF_RADIO_MODE_BLE_LR125KBIT;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_BLE_LR125KBIT));

	return 0;
}

static int cmd_ble_lr500kbit(const struct shell *shell, size_t argc,
			     char **argv)
{
	config.mode = NRF_RADIO_MODE_BLE_LR500KBIT;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_BLE_LR500KBIT));

