KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	return 0;
}
#endif /* CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
static int cmd_ble_ieee(const struct shell *shell, size_t argc, char **argv)
{
	config.mode = NRF_RADIO_MODE_IEEE802154_250KBIT;
	shell_print(shell, "Data rate: %s",
		    STRINGIFY(NRF_RADIO_MODE_IEEE802154_250KBIT));

	return 0;
}
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

static int cmd_pattern_random(const struct shell *shell, size_t argc,
			      char **argv)
{
	config.tx_pattern = TRANSMIT_PATTERN_RANDOM;
	shell_print(shell,
		    "Transmission pattern: %s",
		    STRINGIFY(TRANSMIT_PATTERN_RANDOM));

	return 0;
}

static int cmd_pattern_11110000(const struct shell *shell, size_t argc,
				char **argv)
{
	config.tx_pattern = TRANSMIT_PATTERN_11110000;
	shell_print(shell,
		    "Transmission pattern: %s",
		    STRINGIFY(TRANSMIT_PATTERN_11110000));

	return 0;
}

static int cmd_pattern_11001100(const struct shell *shell, size_t argc,
				char **argv)
{
	config.tx_pattern = TRANSMIT_PATTERN_11001100;
	shell_print(shell,
		    "Transmission pattern: %s",
		    STRINGIFY(TRANSMIT_PATTERN_11001100));

	return 0;
}

SHELL_STATIC_SUBCMD_SET_CREATE(sub_data_rate,
	SHELL_CMD(nrf_1Mbit, NULL, "1 Mbit/s Nordic proprietary radio mode",
		  cmd_nrf_1mbit),
	SHELL_CMD(nrf_2Mbit, NULL, "2 Mbit/s Nordic proprietary radio mode",
		  cmd_nrf_2mbit),

#if defined(RADIO_MODE_MODE_Nrf_250Kbit)
	SHELL_CMD(nrf_250Kbit, NULL,
		  "250 kbit/s Nordic proprietary radio mode",
		  cmd_nrf_250kbit),
#endif /* defined(RADIO_MODE_MODE_Nrf_250Kbit) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_5)
	SHELL_CMD(nrf_4Mbit0_5, NULL,
		  "4 Mbit/s Nordic proprietary radio mode (BT=0.5/h=0.5)",
		  cmd_nrf_4mbit_h_0_5),
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_5) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_25)
	SHELL_CMD(nrf_4Mbit0_25, NULL,
		  "4 Mbit/s Nordic proprietary radio mode (BT=0.5/h=0.25)",
		  cmd_nrf_4mbit_h_0_25),
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_25) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT6)
	SHELL_CMD(nrf_4Mbit_BT06, NULL,
		  "4 Mbps Nordic proprietary radio mode (BT=0.6/h=0.5)",
		  cmd_nrf_4mbit_bt_0_6),
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT6) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT4)
	SHELL_CMD(nrf_4Mbit_BT04, NULL,
		  "4 Mbps Nordic proprietary radio mode (BT=0.4/h=0.5)",
		  cmd_nrf_4mbit_bt_0_4),
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT4) */

	SHELL_CMD(ble_1Mbit, NULL, "1 Mbit/s Bluetooth Low Energy",
		  cmd_ble_1mbit),
	SHELL_CMD(ble_2Mbit, NULL, "2 Mbit/s Bluetooth Low Energy",
		  cmd_ble_2mbit),

#if CONFIG_HAS_HW_NRF_RADIO_BLE_CODED
	SHELL_CMD(ble_lr125Kbit, NULL,
		  "Long range 125 kbit/s TX, 125 kbit/s and 500 kbit/s RX",
		  cmd_ble_lr125kbit),

	SHELL_CMD(ble_lr500Kbit, NULL,
		  "Long range 500 kbit/s TX, 125 kbit/s and 500 kbit/s RX",
		  cmd_ble_lr500kbit),
#endif /* CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	SHELL_CMD(ieee802154_250Kbit, NULL, "IEEE 802.15.4-2006 250 kbit/s",
		  cmd_ble_ieee),
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	SHELL_SUBCMD_SET_END
);

static int cmd_print_payload(const struct shell *shell, size_t argc,
			     char **argv)
{
	struct radio_rx_stats rx_stats;

	memset(&rx_stats, 0, sizeof(rx_stats));

	radio_rx_stats_get(&rx_stats);

	shell_print(shell, "Received payload:");
	shell_hexdump(shell, rx_stats.last_packet.buf,
		      rx_stats.last_packet.len);
	shell_print(shell, "Number of packets: %d", rx_stats.packet_cnt);

	return 0;
}

static void proto_single_tx_done(void)
{
	k_sem_give(&proto_tx_done_sem);
}

static bool proto_require_ieee_mode(const struct shell *shell)
{
	if (!proto_require_ieee_mode_internal()) {
		if (shell != NULL) {
			shell_error(shell, "Set data_rate ieee802154_250Kbit first");
		} else {
			printk("Set data_rate ieee802154_250Kbit first\n");
		}
		return false;
	}

	return true;
}

static int proto_send_frame_ex(const struct shell *shell, enum radio_proto_cmd cmd,
			       uint32_t dst_signature, uint16_t value,
			       uint32_t aux_signature, uint32_t packets_num)
{
	int err;
	int sem_err;
	uint32_t timeout_ms;

	if (!proto_require_ieee_mode(shell)) {
		return -EINVAL;
	}

	if (packets_num == 0) {
		if (shell != NULL) {
			shell_error(shell, "packets_num must be greater than zero");
		} else {
			printk("packets_num must be greater than zero\n");
		}
		return -EINVAL;
	}

	err = radio_proto_prepare_tx_ext(cmd, dst_signature, value, aux_signature);
	if (err) {
		if (shell != NULL) {
			shell_error(shell, "Failed to prepare protocol frame (%d)", err);
		} else {
			printk("Failed to prepare protocol frame (%d)\n", err);
		}
		return err;
	}

	memset(&test_config, 0, sizeof(test_config));
	test_config.mode = config.mode;
	if (packets_num == 1u) {
		/* Single protocol control frames (e.g. discover/per request) should
		 * use plain MODULATED_TX for deterministic one-shot timing.
		 */
		test_config.type = MODULATED_TX;
		test_config.params.modulated_tx.txpower = config.txpower;
		test_config.params.modulated_tx.channel = config.channel_start;
		test_config.params.modulated_tx.pattern = TRANSMIT_PATTERN_RANDOM;
		test_config.params.modulated_tx.packets_num = packets_num;
		test_config.params.modulated_tx.cb = proto_single_tx_done;
	} else {
		/* Multi-packet data bursts use duty cycle pacing so packets are spaced
		 * without CPU busy-wait loops.
		 */
		test_config.type = MODULATED_TX_DUTY_CYCLE;
		test_config.params.modulated_tx_duty_cycle.txpower = config.txpower;
		test_config.params.modulated_tx_duty_cycle.channel = config.channel_start;
		test_config.params.modulated_tx_duty_cycle.pattern = TRANSMIT_PATTERN_RANDOM;
		test_config.params.modulated_tx_duty_cycle.duty_cycle = config.duty_cycle;
		test_config.params.modulated_tx_duty_cycle.packets_num = packets_num;
		test_config.params.modulated_tx_duty_cycle.cb = proto_single_tx_done;
	}
#if CONFIG_FEM
	test_config.fem = config.fem;
#endif /* CONFIG_FEM */

	/* Drain stale completion signals before starting a new TX command. */
	while (k_sem_take(&proto_tx_done_sem, K_NO_WAIT) == 0) {
		/* Do nothing */
	}

