KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	/* Cancel any ongoing radio test (e.g. leftover RX window) before starting TX. */
	radio_test_cancel(test_config.type);
	k_msleep(2);

	if (proto_verbose_logging_enabled()) {
	printk("Starting protocol TX: cmd=%u dst_sig=0x%08x aux_sig=0x%08x value=%u packets=%u\n",
		(unsigned int)cmd,
		dst_signature,
		aux_signature,
		value,
		(unsigned int)packets_num);
	}
	radio_test_start(&test_config);

	/* Conservative timeout so TX flow does not preempt an active burst. */
	timeout_ms = MAX(10000u, packets_num * 40u + 300u);
	sem_err = k_sem_take(&proto_tx_done_sem, K_MSEC(timeout_ms));
	if (proto_verbose_logging_enabled()) {
		printk("Protocol TX completed: cmd=%u dst_sig=0x%08x aux_sig=0x%08x value=%u packets=%u\n",
			(unsigned int)cmd,
			dst_signature,
			aux_signature,
			value,
			(unsigned int)packets_num);
	}
	if (sem_err != 0) {
		if (shell != NULL) {
			shell_error(shell,
				"Timed out waiting for TX completion (cmd=%u packets=%u timeout_ms=%u)",
				(unsigned int)cmd,
				(unsigned int)packets_num,
				(unsigned int)timeout_ms);
		} else {
			printk("Timed out waiting for TX completion (cmd=%u packets=%u timeout_ms=%u)\n",
				(unsigned int)cmd,
				(unsigned int)packets_num,
				(unsigned int)timeout_ms);
		}
		return -ETIMEDOUT;
	}

	return 0;
}

static int proto_send_frame(const struct shell *shell, enum radio_proto_cmd cmd,
			    uint32_t dst_signature, uint16_t value,
			    uint32_t packets_num)
{
	return proto_send_frame_ex(shell, cmd, dst_signature, value, 0u, packets_num);
}

static uint8_t proto_build_cycle_node_list(uint32_t *node_sigs, uint8_t max_count)
{
	struct radio_proto_status status;
	uint8_t count = 0u;

	if (node_sigs == NULL || max_count == 0u) {
		return 0u;
	}

	node_sigs[count++] = proto_cfg.signature;
	radio_proto_get_status(&status);

	for (uint8_t i = 0; i < status.peer_count && count < max_count; i++) {
		if (status.peers[i].signature == 0u ||
		    status.peers[i].signature == proto_cfg.signature) {
			continue;
		}

		node_sigs[count++] = status.peers[i].signature;
	}

	return count;
}

static bool proto_send_control_with_retry(const struct shell *shell,
					       enum radio_proto_cmd cmd,
					       uint32_t dst_signature,
					       uint32_t context_signature,
					       uint16_t value,
					       uint32_t wait_ms,
					       uint32_t retry_ms)
{
	uint32_t ack_wait_ms = wait_ms;

	if (ack_wait_ms < CONTROL_ACK_WAIT_MIN_MS) {
		ack_wait_ms = CONTROL_ACK_WAIT_MIN_MS;
	}

	for (uint8_t attempt = 0; attempt < CONTROL_ACK_RETRY_MAX; attempt++) {
		proto_control_ack_reset();
		if (proto_verbose_logging_enabled()) {
			printk("CTRL_DIAG,tx,cmd=%u,dst=0x%08x,ctx=0x%08x,attempt=%u/%u,wait=%u,retry=%u\n",
			       (unsigned int)cmd,
			       dst_signature,
			       context_signature,
			       (unsigned int)(attempt + 1u),
			       (unsigned int)CONTROL_ACK_RETRY_MAX,
			       (unsigned int)ack_wait_ms,
			       (unsigned int)retry_ms);
		}
		radio_proto_set_role(RADIO_PROTO_ROLE_TX);
		proto_cfg.role = RADIO_PROTO_ROLE_TX;

		if (proto_send_frame_ex(shell,
					    cmd,
					    dst_signature,
					    value,
					    context_signature,
					    1u) != 0) {
			continue;
		}

		k_msleep(2);
		proto_rx_window(ack_wait_ms);

		if (control_ack_received &&
		    control_ack_sender == dst_signature &&
		    control_ack_cmd == (uint16_t)cmd &&
		    control_ack_context == context_signature) {
			if (proto_verbose_logging_enabled()) {
				printk("CTRL_DIAG,ack_ok,cmd=%u,dst=0x%08x,ctx=0x%08x,attempt=%u\n",
				       (unsigned int)cmd,
				       dst_signature,
				       context_signature,
				       (unsigned int)(attempt + 1u));
			}
			return true;
		}

		if (proto_verbose_logging_enabled()) {
			printk("CTRL_DIAG,ack_miss,cmd=%u,dst=0x%08x,ctx=0x%08x,attempt=%u\n",
			       (unsigned int)cmd,
			       dst_signature,
			       context_signature,
			       (unsigned int)(attempt + 1u));
		}

		k_msleep(retry_ms);
	}

	if (proto_verbose_logging_enabled()) {
		printk("CTRL_DIAG,ack_fail,cmd=%u,dst=0x%08x,ctx=0x%08x\n",
		       (unsigned int)cmd,
		       dst_signature,
		       context_signature);
	}

	return false;
}

static void proto_sync_shared_list_to_peer(const struct shell *shell,
					 uint32_t peer_signature,
					 const uint32_t *node_sigs,
					 uint8_t node_count,
					 uint32_t wait_ms,
					 uint32_t retry_ms)
{
	if (!proto_send_control_with_retry(shell,
					 RADIO_PROTO_CMD_SHARED_LIST_CLEAR,
					 peer_signature,
					 0u,
					 0u,
					 wait_ms,
					 retry_ms) && shell != NULL && proto_verbose_logging_enabled()) {
		shell_print(shell, "Shared list clear not acked by 0x%08x", peer_signature);
	}

	for (uint8_t i = 0; i < node_count; i++) {
		if (!proto_send_control_with_retry(shell,
					 RADIO_PROTO_CMD_SHARED_LIST_ADD,
					 peer_signature,
					 node_sigs[i],
					 0u,
					 wait_ms,
					 retry_ms) && shell != NULL && proto_verbose_logging_enabled()) {
			shell_print(shell,
				   "Shared list entry 0x%08x not acked by 0x%08x",
				   node_sigs[i],
				   peer_signature);
		}
	}
}

static void proto_sync_shared_list_to_all_peers(const struct shell *shell,
					      const uint32_t *node_sigs,
					      uint8_t node_count,
					      uint32_t wait_ms,
					      uint32_t retry_ms)
{
	for (uint8_t i = 0; i < node_count; i++) {
		if (node_sigs[i] == proto_cfg.signature) {
			continue;
		}

		proto_sync_shared_list_to_peer(shell,
					     node_sigs[i],
					     node_sigs,
					     node_count,
					     wait_ms,
					     retry_ms);
	}
}

static void proto_send_test_boundary_to_targets(const struct shell *shell,
					      enum radio_proto_cmd cmd,
					      uint32_t broadcaster_signature,
					      const uint32_t *node_sigs,
					      uint8_t node_count,
					      uint32_t wait_ms,
					      uint32_t retry_ms)
{
	for (uint8_t i = 0; i < node_count; i++) {
		if (node_sigs[i] == broadcaster_signature) {
			continue;
		}

		if (!proto_send_control_with_retry(shell,
					 RADIO_PROTO_CMD_TEST_START == cmd ? RADIO_PROTO_CMD_TEST_START : RADIO_PROTO_CMD_TEST_END,
					 node_sigs[i],
					 broadcaster_signature,
					 0u,
					 wait_ms,
					 retry_ms) && shell != NULL && proto_verbose_logging_enabled()) {
			shell_print(shell,
				   "%s not acked by 0x%08x",
				   cmd == RADIO_PROTO_CMD_TEST_START ? "TEST_START" : "TEST_END",
				   node_sigs[i]);
		}
	}
}

static void proto_start_rx_continuous(void)
{
	memset(&test_config, 0, sizeof(test_config));
	test_config.type = RX;
	test_config.mode = config.mode;
	test_config.params.rx.channel = config.channel_start;
	test_config.params.rx.pattern = TRANSMIT_PATTERN_RANDOM;
	test_config.params.rx.packets_num = 0;
#if CONFIG_FEM
	test_config.fem = config.fem;
#endif /* CONFIG_FEM */

	radio_test_start(&test_config);
}

static void proto_rx_window(uint32_t window_ms)
{
	proto_start_rx_continuous();
	k_msleep(window_ms);
	radio_test_cancel(test_config.type);
	k_msleep(5);
}

static void node_button_work_handler(struct k_work *work)
{
	enum radio_node_mode prev_mode;
	uint32_t aggregator_signature;
	bool delivered = false;

