KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	ARG_UNUSED(work);

	if (node_cfg.mode == RADIO_NODE_MODE_COORDINATOR) {
		printk("Local button report: device ID 0x%08x\n", node_hw_signature);
		return;
	}

	if (node_cfg.mode == RADIO_NODE_MODE_TEST_TX) {
		printk("Button report ignored in test_tx mode\n");
		return;
	}

	if (!proto_require_ieee_mode_internal()) {
		printk("Button report requires ieee802154_250Kbit mode\n");
		return;
	}

	prev_mode = (enum radio_node_mode)node_cfg.mode;
	node_stop_radio_activity();
	radio_proto_set_role(RADIO_PROTO_ROLE_TX);
	proto_cfg.role = RADIO_PROTO_ROLE_TX;
	proto_cfg.signature = node_hw_signature;
	radio_proto_set_signature(node_hw_signature);
	aggregator_signature = proto_find_discovered_aggregator_signature();

	if (aggregator_signature != 0u) {
		printk("Button report: sending device ID 0x%08x to aggregator 0x%08x\n",
		       node_hw_signature,
		       aggregator_signature);
		delivered = proto_send_control_with_retry(NULL,
						 RADIO_PROTO_CMD_PROVISION_REQ,
						 aggregator_signature,
						 node_hw_signature,
						 0u,
						 120u,
						 120u);
		if (proto_verbose_logging_enabled()) {
			printk("BTN_DIAG,tx_unicast,src=0x%08x,agg=0x%08x,acked=%u\n",
			       node_hw_signature,
			       aggregator_signature,
			       delivered ? 1u : 0u);
		}
	}

	if (!delivered) {
		printk("Button report: fallback broadcast device ID 0x%08x\n", node_hw_signature);
		if (proto_send_frame(NULL,
				     RADIO_PROTO_CMD_PROVISION_REQ,
				     RADIO_PROTO_BROADCAST_SIG,
				     0u,
				     1u) != 0) {
			node_apply_mode(prev_mode);
			return;
		}
	}

	node_apply_mode(prev_mode);
}

int radio_node_init(void)
{
	node_hw_signature = node_read_hardware_signature();

	if (node_settings_loaded) {
		if (node_cfg.magic != RADIO_NODE_SETTINGS_MAGIC ||
		    node_cfg.version != RADIO_NODE_SETTINGS_VERSION) {
			node_cfg.magic = RADIO_NODE_SETTINGS_MAGIC;
			node_cfg.version = RADIO_NODE_SETTINGS_VERSION;
			node_cfg.mode = RADIO_NODE_MODE_UNASSIGNED;
			node_cfg.assigned_signature = 0u;
			node_cfg.next_receiver_id = 1u;
			node_cfg.node_type = RADIO_SURVEY_NODE_TYPE_X;
			node_cfg.is_data_aggregator = 0u;
			node_cfg.reserved0 = 0u;
		}
	} else {
		node_cfg.magic = RADIO_NODE_SETTINGS_MAGIC;
		node_cfg.version = RADIO_NODE_SETTINGS_VERSION;
		node_cfg.mode = RADIO_NODE_MODE_UNASSIGNED;
		node_cfg.assigned_signature = 0u;
		node_cfg.next_receiver_id = 1u;
		node_cfg.node_type = RADIO_SURVEY_NODE_TYPE_X;
		node_cfg.is_data_aggregator = 0u;
		node_cfg.reserved0 = 0u;
	}

	if (!node_is_type_valid(node_cfg.node_type)) {
		node_cfg.node_type = RADIO_SURVEY_NODE_TYPE_X;
	}

	k_work_init(&node_button_work, node_button_work_handler);
	k_work_init(&node_apply_receiver_work, node_apply_receiver_work_handler);
	k_work_queue_start(&remote_test_workq,
			   remote_test_workq_stack,
			   K_THREAD_STACK_SIZEOF(remote_test_workq_stack),
			   CONFIG_SYSTEM_WORKQUEUE_PRIORITY,
			   NULL);
	k_work_init_delayable(&remote_test_work, remote_test_work_handler);
	k_work_init_delayable(&node_release_work, node_release_work_handler);
	k_work_init_delayable(&node_settings_save_work, node_settings_save_work_handler);

	/* Reset any prior receiver assignment after boot/reset. */
	node_cfg.assigned_signature = 0u;
	node_pending_assigned_signature = 0u;
	radio_proto_reset();

	/* Always start from unassigned state after boot/reset. */
	node_apply_mode(RADIO_NODE_MODE_UNASSIGNED);
	return 0;
}

void radio_node_handle_proto_frame(const struct radio_proto_frame *frame)
{
	if (frame == NULL) {
		return;
	}


	if (frame->cmd == RADIO_PROTO_CMD_PROVISION_REQ) {
		if (frame->dst_signature == proto_cfg.signature ||
		    frame->dst_signature == RADIO_PROTO_BROADCAST_SIG) {
			if (proto_verbose_logging_enabled()) {
				printk("BTN_DIAG,rx_provision_req,from=0x%08x,to=0x%08x,aux=0x%08x\n",
				       frame->src_signature,
				       frame->dst_signature,
				       frame->aux_signature);
			}

			radio_proto_schedule_response_ext(RADIO_PROTO_CMD_CONTROL_ACK,
					 frame->src_signature,
					 RADIO_PROTO_CMD_PROVISION_REQ,
					 frame->aux_signature);
		}

		if (node_cfg.mode == RADIO_NODE_MODE_COORDINATOR &&
		    (frame->dst_signature == proto_cfg.signature ||
		     frame->dst_signature == RADIO_PROTO_BROADCAST_SIG)) {
			printk("Slave button report received: device ID 0x%08x\n",
			       frame->src_signature);
		}
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_CONTROL_ACK &&
	    frame->dst_signature == proto_cfg.signature) {
		control_ack_sender = frame->src_signature;
		control_ack_cmd = frame->value;
		control_ack_context = frame->aux_signature;
		control_ack_received = true;
		if (proto_verbose_logging_enabled()) {
			printk("CTRL_DIAG,ack_rx,from=0x%08x,cmd=%u,ctx=0x%08x\n",
			       frame->src_signature,
			       (unsigned int)frame->value,
			       frame->aux_signature);
		}
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_SHARED_LIST_CLEAR &&
	    frame->dst_signature == proto_cfg.signature) {
		shared_test_list_clear_local();
		radio_proto_schedule_response_ext(RADIO_PROTO_CMD_CONTROL_ACK,
					 frame->src_signature,
					 RADIO_PROTO_CMD_SHARED_LIST_CLEAR,
					 frame->aux_signature);
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_SHARED_LIST_ADD &&
	    frame->dst_signature == proto_cfg.signature) {
		(void)shared_test_list_add_local(frame->aux_signature);
		radio_proto_schedule_response_ext(RADIO_PROTO_CMD_CONTROL_ACK,
					 frame->src_signature,
					 RADIO_PROTO_CMD_SHARED_LIST_ADD,
					 frame->aux_signature);
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_TEST_START &&
	    frame->dst_signature == proto_cfg.signature) {
		printk("BOUNDARY_DIAG,accept,cmd=%u,src=0x%08x,dst=0x%08x,local=0x%08x,mode=%s,role=%u\n",
		       (unsigned int)frame->cmd,
		       frame->src_signature,
		       frame->dst_signature,
		       proto_cfg.signature,
		       node_mode_str((enum radio_node_mode)node_cfg.mode),
		       (unsigned int)proto_cfg.role);
		radio_proto_begin_test_session(frame->src_signature);
		radio_proto_schedule_response_ext(RADIO_PROTO_CMD_CONTROL_ACK,
					 frame->src_signature,
					 RADIO_PROTO_CMD_TEST_START,
					 frame->aux_signature);
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_TEST_START &&
	    proto_verbose_logging_enabled()) {
		printk("Ignored TEST_START from 0x%08x: dst=0x%08x local=0x%08x mode=%s role=%u\n",
		       frame->src_signature,
		       frame->dst_signature,
		       proto_cfg.signature,
		       node_mode_str((enum radio_node_mode)node_cfg.mode),
		       (unsigned int)proto_cfg.role);
	}

	if (frame->cmd == RADIO_PROTO_CMD_TEST_END &&
	    frame->dst_signature == proto_cfg.signature) {
		printk("BOUNDARY_DIAG,accept,cmd=%u,src=0x%08x,dst=0x%08x,local=0x%08x,mode=%s,role=%u\n",
		       (unsigned int)frame->cmd,
		       frame->src_signature,
		       frame->dst_signature,
		       proto_cfg.signature,
		       node_mode_str((enum radio_node_mode)node_cfg.mode),
		       (unsigned int)proto_cfg.role);
		radio_proto_end_test_session(frame->src_signature);
		radio_proto_schedule_response_ext(RADIO_PROTO_CMD_CONTROL_ACK,
					 frame->src_signature,
					 RADIO_PROTO_CMD_TEST_END,
					 frame->aux_signature);
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_TEST_END &&
	    proto_verbose_logging_enabled()) {
		printk("Ignored TEST_END from 0x%08x: dst=0x%08x local=0x%08x mode=%s role=%u\n",
		       frame->src_signature,
		       frame->dst_signature,
		       proto_cfg.signature,
		       node_mode_str((enum radio_node_mode)node_cfg.mode),
		       (unsigned int)proto_cfg.role);
	}

