KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	if (frame->cmd == RADIO_PROTO_CMD_SET_CHANNEL &&
	    (frame->dst_signature == proto_cfg.signature ||
	     frame->dst_signature == RADIO_PROTO_BROADCAST_SIG)) {
		uint8_t new_channel = (uint8_t)(frame->value & 0xFFu);
		if (new_channel >= 11 && new_channel <= 26) {
			if (proto_verbose_logging_enabled()) {
				printk("Set channel to %u (from 0x%08x)\n", new_channel, frame->src_signature);
			}
			if (frame->dst_signature != RADIO_PROTO_BROADCAST_SIG) {
				/* Send ACK only if it was unicast */
				node_pending_channel_apply = new_channel;
				node_pending_channel_apply_valid = true;
				radio_proto_schedule_response_ext(RADIO_PROTO_CMD_CONTROL_ACK,
							 frame->src_signature,
							 RADIO_PROTO_CMD_SET_CHANNEL,
							 frame->aux_signature);
			} else {
				/* Broadcast SET_CHANNEL: retune immediately since no ACK needed */
				node_pending_channel_apply_valid = false;
				config.channel_start = new_channel;
				config.channel_end = new_channel;
				node_apply_mode((enum radio_node_mode)node_cfg.mode);
			}
		}
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_RELEASE_REQ &&
	    node_cfg.mode != RADIO_NODE_MODE_COORDINATOR &&
	    node_cfg.mode != RADIO_NODE_MODE_TEST_TX &&
	    frame->dst_signature == proto_cfg.signature) {
		if (proto_verbose_logging_enabled()) {
			printk("Received RELEASE_REQ from 0x%08x (mode=%s), sending RELEASE_RSP\n",
			       frame->src_signature,
			       node_mode_str((enum radio_node_mode)node_cfg.mode));
		}
		/* Send RELEASE_RSP back to the requester. Unicast responses are relayable
		 * in current policy; keep aux for per-attempt uniqueness.
		 */
		radio_proto_schedule_response_ext(RADIO_PROTO_CMD_RELEASE_RSP,
						 frame->src_signature,
						 0u,
						 frame->aux_signature);
		k_work_reschedule(&node_release_work, K_MSEC(NODE_RELEASE_APPLY_DELAY_MS));
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_RELEASE_REQ &&
	    proto_verbose_logging_enabled()) {
		printk("Ignored RELEASE_REQ from 0x%08x: mode=%s dst=0x%08x local=0x%08x\n",
		       frame->src_signature,
		       node_mode_str((enum radio_node_mode)node_cfg.mode),
		       frame->dst_signature,
		       proto_cfg.signature);
	}

	if (frame->cmd == RADIO_PROTO_CMD_REMOTE_TEST_REQ &&
	    node_cfg.mode != RADIO_NODE_MODE_COORDINATOR &&
	    node_cfg.mode != RADIO_NODE_MODE_TEST_TX &&
	    frame->dst_signature == proto_cfg.signature) {
		if (remote_test_request.busy || remote_test_request.pending) {
			radio_proto_schedule_response(RADIO_PROTO_CMD_REMOTE_TEST_REQ_ACK,
					     frame->src_signature,
					     frame->value);
			if (proto_verbose_logging_enabled()) {
				printk("Remote test request already active; acked duplicate from 0x%08x\n",
				       frame->src_signature);
			}
			return;
		}

		remote_test_request.controller_signature = frame->src_signature;
		remote_test_request.packets = frame->value;
		remote_test_request.wait_ms = proto_unpack_u16_low(frame->aux_signature);
		remote_test_request.retry_ms = proto_unpack_u16_high(frame->aux_signature);
		if (remote_test_request.wait_ms == 0u) {
			remote_test_request.wait_ms = (uint16_t)proto_cfg.per_wait_ms;
		}
		if (remote_test_request.retry_ms == 0u) {
			remote_test_request.retry_ms = remote_test_request.wait_ms;
		}
		remote_test_request.pending = true;
		radio_proto_schedule_response(RADIO_PROTO_CMD_REMOTE_TEST_REQ_ACK,
					     frame->src_signature,
					     frame->value);
		k_work_reschedule_for_queue(&remote_test_workq,
					  &remote_test_work,
					  K_MSEC(REMOTE_TEST_WORK_START_DELAY_MS));
		if (proto_verbose_logging_enabled()) {
			printk("Remote test request accepted from 0x%08x\n", frame->src_signature);
		}
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_REMOTE_TEST_REQ_ACK &&
	    frame->dst_signature == proto_cfg.signature &&
	    remote_test_monitor.active &&
	    frame->src_signature == remote_test_monitor.delegate_signature) {
		remote_test_req_ack_packets = frame->value;
		remote_test_req_ack_received = true;
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_REMOTE_TEST_REPORT &&
	    frame->dst_signature == proto_cfg.signature &&
	    remote_test_monitor.active &&
	    remote_test_monitor.req_acked &&
	    frame->src_signature == remote_test_monitor.delegate_signature) {
		remote_test_monitor.last_activity_ticks = (uint32_t)k_uptime_get_32();
		if (remote_test_monitor_mark_peer_reported(frame->aux_signature)) {
			remote_test_monitor.reported_peers++;
			proto_emit_per_report(frame->aux_signature,
					      frame->src_signature,
					      remote_test_monitor.expected_packets,
					      frame->value);
		}

		radio_proto_schedule_response_ext(RADIO_PROTO_CMD_REMOTE_TEST_REPORT_ACK,
						 frame->src_signature,
						 frame->value,
						 frame->aux_signature);
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_REMOTE_TEST_DONE &&
	    frame->dst_signature == proto_cfg.signature &&
	    remote_test_monitor.active &&
	    remote_test_monitor.req_acked &&
	    frame->src_signature == remote_test_monitor.delegate_signature) {
		remote_test_monitor.last_activity_ticks = (uint32_t)k_uptime_get_32();
		remote_test_monitor.reported_peers = remote_test_monitor.reported_peer_count;
		remote_test_monitor.done = true;
		radio_proto_schedule_response(RADIO_PROTO_CMD_REMOTE_TEST_DONE_ACK,
					     frame->src_signature,
					     remote_test_monitor.reported_peers);
		if (proto_verbose_logging_enabled()) {
			printk("Remote test finished: delegate=0x%08x reports=%u\n",
			       frame->src_signature,
			       remote_test_monitor.reported_peers);
		}
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_REMOTE_TEST_REPORT_ACK &&
	    frame->dst_signature == proto_cfg.signature &&
	    remote_test_request.busy &&
	    frame->src_signature == remote_test_request.controller_signature) {
		remote_test_report_ack_peer = frame->aux_signature;
		remote_test_report_ack_value = frame->value;
		remote_test_report_ack_received = true;
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_REMOTE_TEST_DONE_ACK &&
	    frame->dst_signature == proto_cfg.signature &&
	    remote_test_request.busy &&
	    frame->src_signature == remote_test_request.controller_signature) {
		remote_test_done_ack_reports = frame->value;
		remote_test_done_ack_received = true;
		return;
	}

	if (frame->cmd == RADIO_PROTO_CMD_PROVISION_RSP &&
	    node_cfg.mode == RADIO_NODE_MODE_UNASSIGNED &&
	    frame->dst_signature == node_hw_signature) {
		node_pending_assigned_signature = node_hw_signature;
		k_work_submit(&node_apply_receiver_work);
	}
}

void radio_node_handle_discover_req(uint32_t src_signature, uint32_t dst_signature)
{
	bool for_me = (dst_signature == RADIO_PROTO_BROADCAST_SIG) ||
		      (dst_signature == proto_cfg.signature);

