KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	if (!for_me) {
		return;
	}

	/* Cancel any pending delayed release from a prior discover_list_clear pass.
	 * Otherwise a stale release work item can flip this node back to unassigned
	 * while a fresh DISCOVER_RSP/provisioning flow is in progress.
	 */
	(void)k_work_cancel_delayable(&node_release_work);

	if (node_cfg.mode == RADIO_NODE_MODE_TEST_TX) {
		return;
	}

	if (node_cfg.mode == RADIO_NODE_MODE_COORDINATOR) {
		if (remote_test_monitor.active && proto_cfg.role == RADIO_PROTO_ROLE_RX) {
			radio_proto_schedule_response(RADIO_PROTO_CMD_DISCOVER_RSP,
					     src_signature,
					     0u);
		}
		return;
	}

	if (node_cfg.mode == RADIO_NODE_MODE_UNASSIGNED) {
		node_pending_assigned_signature = node_hw_signature;
		node_pending_discover_rsp_dst = src_signature;
		k_work_submit(&node_apply_receiver_work);
		return;
	}

	if (proto_cfg.role == RADIO_PROTO_ROLE_RX) {
		node_rx_ready = true;
		radio_proto_schedule_response(RADIO_PROTO_CMD_DISCOVER_RSP,
					     src_signature,
					     0u);
	}
}

void radio_node_handle_button_press(void)
{
	k_work_submit_to_queue(&remote_test_workq, &node_button_work);
}

enum radio_node_mode radio_node_get_mode(void)
{
	return (enum radio_node_mode)node_cfg.mode;
}

bool radio_node_led_should_blink(void)
{
	return node_rx_ready;
}

bool radio_node_led_should_be_on(void)
{
	return node_cfg.mode == RADIO_NODE_MODE_COORDINATOR;
}

static int cmd_proto_signature_set(const struct shell *shell, size_t argc, char **argv)
{
	unsigned long sig;

	if (argc != 2) {
		shell_error(shell, "Usage: proto_signature <u32>");
		return -EINVAL;
	}

	sig = strtoul(argv[1], NULL, 0);
	proto_cfg.signature = (uint32_t)sig;
	radio_proto_set_signature(proto_cfg.signature);

	shell_print(shell, "Protocol signature set to 0x%08lx", sig);
	return 0;
}

static int cmd_proto_role_set(const struct shell *shell, size_t argc, char **argv)
{
	if (argc != 2) {
		shell_error(shell, "Usage: proto_role <disabled|tx|rx>");
		return -EINVAL;
	}

	if (strcmp(argv[1], "disabled") == 0) {
		proto_cfg.role = RADIO_PROTO_ROLE_DISABLED;
	} else if (strcmp(argv[1], "tx") == 0) {
		proto_cfg.role = RADIO_PROTO_ROLE_TX;
	} else if (strcmp(argv[1], "rx") == 0) {
		proto_cfg.role = RADIO_PROTO_ROLE_RX;
	} else {
		shell_error(shell, "Invalid role: %s", argv[1]);
		return -EINVAL;
	}

	radio_proto_set_role(proto_cfg.role);
	shell_print(shell, "Protocol role updated");
	return 0;
}

static int cmd_proto_reset(const struct shell *shell, size_t argc, char **argv)
{
	radio_proto_reset();
	shared_test_list_clear_local();
	proto_control_ack_reset();
	shell_print(shell, "Protocol state reset");
	return 0;
}

static int cmd_proto_status(const struct shell *shell, size_t argc, char **argv)
{
	struct radio_proto_status status;

	radio_proto_get_status(&status);

	shell_print(shell,
		"proto role=%u sig=0x%08x local_type=%s local_agg=%u discover_req=%u discover_rsp=%u test_data=%u per_req=%u per_rsp=%u local_test_rx=%u peers=%u",
		status.role,
		status.local_signature,
		node_type_str((uint8_t)radio_proto_get_local_node_type()),
		radio_proto_get_local_aggregator() ? 1u : 0u,
		status.discover_req_seen,
		status.discover_rsp_seen,
		status.test_data_seen,
		status.per_req_seen,
		status.per_rsp_seen,
		status.local_test_data_rx,
		status.peer_count);

	for (uint8_t i = 0; i < status.peer_count; i++) {
		const struct radio_proto_peer *peer = &status.peers[i];

		shell_print(shell,
			"peer[%u] sig=0x%08x type=%s agg=%u discover=%u per=%u clear=%u release=%u reported_rx=%u",
			i,
			peer->signature,
			node_type_str(peer->node_type),
			peer->is_data_aggregator ? 1u : 0u,
			peer->seen_discover_rsp,
			peer->seen_per_rsp,
			peer->seen_clear_per_rsp,
			peer->seen_release_rsp,
			peer->reported_rx_packets);
	}

	return 0;
}

static int cmd_proto_rx_start(const struct shell *shell, size_t argc, char **argv)
{
	if (!proto_require_ieee_mode(shell)) {
		return -EINVAL;
	}

	radio_proto_set_role(RADIO_PROTO_ROLE_RX);
	proto_cfg.role = RADIO_PROTO_ROLE_RX;
	proto_start_rx_continuous();
	shell_print(shell, "Protocol RX started on channel %u", config.channel_start);
	return 0;
}

static int cmd_proto_send_discover(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t wait_ms = proto_cfg.discover_window_ms;
	uint32_t peer_sigs[RADIO_PROTO_MAX_PEERS];
	uint8_t peer_count;
	enum radio_node_mode prev_mode = (enum radio_node_mode)node_cfg.mode;
	enum radio_proto_role prev_role = proto_cfg.role;
	int err = 0;

	proto_ack_start(shell, "proto_send_discover");
	if (argc > 2) {
		shell_error(shell, "Usage: proto_send_discover [wait_ms]");
		err = -EINVAL;
		goto out;
	}

	if (argc == 2) {
		wait_ms = strtoul(argv[1], NULL, 0);
	}

	proto_cfg.discover_window_ms = wait_ms;
	radio_proto_reset_discover_round();

	radio_proto_set_role(RADIO_PROTO_ROLE_TX);
	proto_cfg.role = RADIO_PROTO_ROLE_TX;

	/* Run discover in two TX->RX phases. This avoids missing responses to the
	 * first request while the coordinator is still transmitting the second one.
	 */
	for (uint32_t discover_round = 0u; discover_round < 2u; discover_round++) {
		if (proto_send_frame_ex(shell,
					RADIO_PROTO_CMD_DISCOVER_REQ,
					0xFFFFFFFFu,
					0u,
					discover_round,
					1u) != 0) {
			err = -EIO;
			goto out;
		}

		k_msleep(2);
		proto_rx_window(wait_ms);
	}
	peer_count = radio_proto_get_peer_signatures(peer_sigs, ARRAY_SIZE(peer_sigs));
	if (proto_verbose_logging_enabled()) {
		shell_print(shell, "DISCOVER complete: %u peers", peer_count);
	}

	/* If discover was run from coordinator mode, return to continuous RX so
	 * slave button ID reports are still received.
	 */
	if (prev_mode == RADIO_NODE_MODE_COORDINATOR) {
		node_apply_mode(RADIO_NODE_MODE_COORDINATOR);
	} else {
		proto_cfg.role = prev_role;
		radio_proto_set_role(prev_role);
	}

out:
	proto_ack_end(shell, "proto_send_discover", err);
	return err;
}

static int cmd_discover_list_clear(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t peer_sigs[RADIO_PROTO_MAX_PEERS];
	uint8_t peer_count;
	uint32_t wait_ms = proto_cfg.provision_wait_ms;
	struct radio_proto_status status;
	enum radio_node_mode prev_mode = (enum radio_node_mode)node_cfg.mode;
	enum radio_proto_role prev_role = proto_cfg.role;
	bool all_released = false;
	uint8_t max_release_iterations = 10;
	uint8_t release_iteration = 0;

