KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);
	proto_ack_start(shell, "discover_list_clear");

	peer_count = radio_proto_get_peer_signatures(peer_sigs, ARRAY_SIZE(peer_sigs));
	proto_release_cancel = false;
	radio_proto_reset_release_results();
	radio_proto_set_role(RADIO_PROTO_ROLE_TX);
	proto_cfg.role = RADIO_PROTO_ROLE_TX;

	while (!proto_release_cancel && !all_released && peer_count > 0 && release_iteration < max_release_iterations) {
		release_iteration++;
		if (proto_verbose_logging_enabled()) {
			shell_print(shell,
				   "Release pass %u/%u",
				   release_iteration,
				   max_release_iterations);
		}
		all_released = true;
		radio_proto_get_status(&status);

		for (uint8_t i = 0; i < peer_count; i++) {
			bool released = false;

			for (uint8_t p = 0; p < status.peer_count; p++) {
				if (status.peers[p].signature == peer_sigs[i] &&
				    status.peers[p].seen_release_rsp) {
					released = true;
					break;
				}
			}

			if (released) {
				continue;
			}

			all_released = false;
			if (proto_verbose_logging_enabled()) {
				shell_print(shell, "Release peer 0x%08x to unassigned", peer_sigs[i]);
			}

			if (proto_send_frame_ex(shell,
				       RADIO_PROTO_CMD_RELEASE_REQ,
				       peer_sigs[i],
				       0u,
				       (uint32_t)release_iteration,
				       1u) != 0) {
				continue;
			}

			k_msleep(2);
			proto_rx_window(wait_ms);
			radio_proto_get_status(&status);

			for (uint8_t p = 0; p < status.peer_count; p++) {
				if (status.peers[p].signature == peer_sigs[i] &&
				    status.peers[p].seen_release_rsp) {
					if (proto_verbose_logging_enabled()) {
						shell_print(shell,
							"Peer 0x%08x returned to unassigned",
							peer_sigs[i]);
					}
					break;
				}
			}

			if (proto_verbose_logging_enabled()) {
				bool seen_release_rsp = false;

				for (uint8_t p = 0; p < status.peer_count; p++) {
					if (status.peers[p].signature == peer_sigs[i] &&
					    status.peers[p].seen_release_rsp) {
						seen_release_rsp = true;
						break;
					}
				}

				if (!seen_release_rsp) {
					shell_print(shell,
						   "No RELEASE_RSP yet from 0x%08x",
						   peer_sigs[i]);
				}
			}
		}

		if (!all_released && !proto_release_cancel) {
			k_msleep(wait_ms);
		}
	}

	radio_proto_clear_peer_list();
	shared_test_list_clear_local();
	radio_proto_reset_local_test_counter();

	if (prev_mode == RADIO_NODE_MODE_COORDINATOR) {
		node_apply_mode(RADIO_NODE_MODE_COORDINATOR);
	} else {
		proto_cfg.role = prev_role;
		radio_proto_set_role(prev_role);
	}

	if (proto_verbose_logging_enabled()) {
		if (peer_count == 0) {
			shell_print(shell, "Discovered peer list cleared");
		} else if (proto_release_cancel) {
			shell_print(shell, "Peer release cancelled; discovered peer list cleared");
		} else if (all_released) {
			shell_print(shell, "Discovered peer list cleared and peers returned to unassigned");
		} else if (release_iteration >= max_release_iterations) {
			shell_print(shell, "Release timeout; discovered peer list cleared");
		} else {
			shell_print(shell, "Discovered peer list cleared");
		}
	}

	proto_release_cancel = false;
	proto_ack_end(shell, "discover_list_clear", 0);
	return 0;
}

static int cmd_discover_status(const struct shell *shell, size_t argc, char **argv)
{
	struct radio_proto_status status;

	ARG_UNUSED(argc);
	ARG_UNUSED(argv);
	proto_ack_start(shell, "discover_status");

	radio_proto_get_status(&status);
	shell_print(shell, "DISCOVER_STATUS,index,signature,node_type,is_aggregator");
	for (uint8_t i = 0; i < status.peer_count; i++) {
		shell_print(shell,
			"DISCOVER_STATUS,%u,0x%08x,%s,%u",
			i,
			status.peers[i].signature,
			node_type_str(status.peers[i].node_type),
			status.peers[i].is_data_aggregator ? 1u : 0u);
	}

	proto_ack_end(shell, "discover_status", 0);
	return 0;
}

static int cmd_proto_set_channel(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t channel;
	uint32_t wait_ms = proto_cfg.per_wait_ms;
	uint32_t retry_ms = proto_cfg.per_wait_ms;
	struct radio_proto_status status;
	uint8_t success_count = 0;
	uint8_t total_count = 0;
	int err = 0;

	proto_ack_start(shell, "proto_set_channel");

	if (argc < 2 || argc > 4) {
		shell_error(shell, "Usage: proto_set_channel <channel> [wait_ms] [retry_ms]");
		err = -EINVAL;
		goto out;
	}

	channel = strtoul(argv[1], NULL, 0);
	if (channel < IEEE_MIN_CHANNEL || channel > IEEE_MAX_CHANNEL) {
		shell_error(shell, "channel must be between %u and %u", IEEE_MIN_CHANNEL, IEEE_MAX_CHANNEL);
		err = -EINVAL;
		goto out;
	}

	if (argc >= 3) {
		wait_ms = strtoul(argv[2], NULL, 0);
	}
	if (argc == 4) {
		retry_ms = strtoul(argv[3], NULL, 0);
	}

	radio_proto_get_status(&status);
	total_count = status.peer_count;

	/* First, send SET_CHANNEL to all discovered peers and wait for ACKs */
	for (uint8_t i = 0; i < status.peer_count; i++) {
		if (proto_send_control_with_retry(shell,
						RADIO_PROTO_CMD_SET_CHANNEL,
						status.peers[i].signature,
						0u,
						(uint16_t)channel,
						wait_ms,
						retry_ms)) {
			success_count++;
			if (shell != NULL) {
				shell_print(shell, "Set channel %u on peer 0x%08x", 
					    (unsigned int)channel, status.peers[i].signature);
			}
		} else if (shell != NULL) {
			shell_print(shell, "Failed to set channel %u on peer 0x%08x", 
				    (unsigned int)channel, status.peers[i].signature);
		}
	}

	/* Only change coordinator's own channel AFTER all peers have ACKed */
	if (success_count == total_count && total_count > 0) {
		if (shell != NULL) {
			shell_print(shell, "All peers updated, changing coordinator channel to %u", 
				    (unsigned int)channel);
		}
		config.channel_start = (uint8_t)channel;
		config.channel_end = (uint8_t)channel;
		node_apply_mode((enum radio_node_mode)node_cfg.mode);
		err = 0;
		goto out;
	} else if (total_count == 0) {
		/* No peers to update, just change coordinator's channel */
		if (shell != NULL) {
			shell_print(shell, "No peers discovered, changing coordinator channel to %u", 
				    (unsigned int)channel);
		}
		config.channel_start = (uint8_t)channel;
		config.channel_end = (uint8_t)channel;
		node_apply_mode((enum radio_node_mode)node_cfg.mode);
		err = 0;
		goto out;
	}

	if (shell != NULL) {
		shell_print(shell, "Set channel failed: %u/%u peers updated (not updating coordinator)", 
			    (unsigned int)success_count, (unsigned int)total_count);
	}

	err = -EIO;

out:
	proto_ack_end(shell, "proto_set_channel", err);
	return err;
}

static int cmd_proto_send_test_data(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t packets = proto_cfg.test_packets;

	if (argc > 2) {
		shell_error(shell, "Usage: proto_send_test_data [packets]");
		return -EINVAL;
	}

