KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	if (argc == 2) {
		packets = strtoul(argv[1], NULL, 0);
	}

	if (packets == 0 || packets > UINT16_MAX) {
		shell_error(shell, "packets must be in range 1..65535");
		return -EINVAL;
	}

	proto_cfg.test_packets = packets;
	radio_proto_set_role(RADIO_PROTO_ROLE_TX);
	proto_cfg.role = RADIO_PROTO_ROLE_TX;

	return proto_send_frame(shell,
		RADIO_PROTO_CMD_TEST_DATA,
		0xFFFFFFFFu,
		(uint16_t)packets,
		packets);
}

static int cmd_proto_send_per_req(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t dst_sig;
	uint32_t expected;
	uint32_t wait_ms = proto_cfg.per_wait_ms;
	struct radio_proto_status status;
	bool got_rsp = false;

	if (argc < 3 || argc > 4) {
		shell_error(shell, "Usage: proto_send_per_req <dst_sig> <expected_packets> [wait_ms]");
		return -EINVAL;
	}

	dst_sig = strtoul(argv[1], NULL, 0);
	expected = strtoul(argv[2], NULL, 0);
	if (expected > UINT16_MAX) {
		shell_error(shell, "expected_packets must be <= 65535");
		return -EINVAL;
	}

	if (argc == 4) {
		wait_ms = strtoul(argv[3], NULL, 0);
	}

	radio_proto_set_role(RADIO_PROTO_ROLE_TX);
	proto_cfg.role = RADIO_PROTO_ROLE_TX;

	if (proto_send_frame(shell,
		RADIO_PROTO_CMD_PER_REQ,
		dst_sig,
		(uint16_t)expected,
		1) != 0) {
		return -EIO;
	}

	k_msleep(2);
	proto_rx_window(wait_ms);
	radio_proto_get_status(&status);

	for (uint8_t i = 0; i < status.peer_count; i++) {
		if (status.peers[i].signature == dst_sig && status.peers[i].seen_per_rsp) {
			shell_print(shell,
				"PER response from 0x%08x: rx=%u expected=%u",
				dst_sig,
				status.peers[i].reported_rx_packets,
				(unsigned int)expected);
			got_rsp = true;
			break;
		}
	}

	if (!got_rsp) {
		shell_print(shell, "No PER response from 0x%08x", dst_sig);
	}

	return 0;
}

static int proto_collect_per_run(const struct shell *shell, uint32_t expected,
				 uint32_t wait_ms, uint32_t retry_ms)
{
	uint32_t peer_sigs[RADIO_PROTO_MAX_PEERS];
	uint32_t clear_peer_sigs[RADIO_PROTO_MAX_PEERS];
	uint8_t peer_count = 0u;
	uint8_t clear_peer_count = 0u;
	bool all_per_done = false;
	bool all_clear_done = false;
	uint8_t per_rounds = 0u;
	struct radio_proto_status status;

	if (expected == 0 || expected > UINT16_MAX) {
		if (shell != NULL) {
			shell_error(shell, "expected_packets must be in range 1..65535");
		}
		return -EINVAL;
	}

	radio_proto_get_status(&status);
	for (uint8_t i = 0; i < status.peer_count; i++) {
		const struct radio_proto_peer *peer = &status.peers[i];

		if (clear_peer_count < ARRAY_SIZE(clear_peer_sigs)) {
			clear_peer_sigs[clear_peer_count++] = peer->signature;
		}

		if (peer_count < ARRAY_SIZE(peer_sigs) && node_peer_eligible_for_per(peer)) {
			peer_sigs[peer_count++] = peer->signature;
			continue;
		}

		if (proto_verbose_logging_enabled() && shell != NULL) {
			shell_print(shell,
				"Skipping peer 0x%08x (local_type=%s peer_type=%s)",
				peer->signature,
				node_type_str(node_cfg.node_type),
				node_type_str(peer->node_type));
		}
	}

	if (peer_count == 0 && clear_peer_count == 0) {
		if (shell != NULL) {
			shell_print(shell, "No discovered peers in current list");
		}
		return 0;
	}

	if (peer_count == 0) {
		all_per_done = true;
		if (shell != NULL && proto_verbose_logging_enabled()) {
			shell_print(shell,
				   "No eligible discovered peers for local node type %s; clearing counters on all peers",
				   node_type_str(node_cfg.node_type));
		}
	}

	proto_collect_per_cancel = false;
	proto_cfg.per_wait_ms = wait_ms;
	radio_proto_reset_per_results();
	radio_proto_reset_clear_per_results();
	radio_proto_set_role(RADIO_PROTO_ROLE_TX);
	proto_cfg.role = RADIO_PROTO_ROLE_TX;

	while (!proto_collect_per_cancel && !all_per_done && per_rounds < PROTO_PER_PHASE_MAX_ROUNDS) {
		per_rounds++;
		all_per_done = true;
		radio_proto_get_status(&status);

		for (uint8_t i = 0; i < peer_count; i++) {
			bool already_reported = false;

			for (uint8_t p = 0; p < status.peer_count; p++) {
				if (status.peers[p].signature == peer_sigs[i] &&
				    status.peers[p].seen_per_rsp) {
					already_reported = true;
					break;
				}
			}

			if (already_reported) {
				continue;
			}

			all_per_done = false;
			if (proto_verbose_logging_enabled() && shell != NULL) {
				shell_print(shell, "Request PER from 0x%08x", peer_sigs[i]);
			}

			if (proto_send_frame(shell,
				    RADIO_PROTO_CMD_PER_REQ,
				    peer_sigs[i],
				    (uint16_t)expected,
				    1) != 0) {
				continue;
			}

			k_msleep(2);
			proto_rx_window(wait_ms);
			radio_proto_get_status(&status);

			for (uint8_t p = 0; p < status.peer_count; p++) {
				if (status.peers[p].signature == peer_sigs[i] &&
				    status.peers[p].seen_per_rsp) {
					proto_emit_per_report(peer_sigs[i],
							  proto_cfg.signature,
							  (uint16_t)expected,
							  (uint16_t)status.peers[p].reported_rx_packets);
					if (proto_verbose_logging_enabled() && shell != NULL) {
						shell_print(shell,
							"PER response from 0x%08x: rx=%u expected=%u",
							peer_sigs[i],
							status.peers[p].reported_rx_packets,
							(unsigned int)expected);
					}
					break;
				}
			}
		}

		if (!all_per_done && !proto_collect_per_cancel) {
			k_msleep(retry_ms);
		}
	}

	all_clear_done = true;
	for (uint8_t i = 0; i < clear_peer_count && !proto_collect_per_cancel; i++) {
		bool cleared;

		if (proto_verbose_logging_enabled() && shell != NULL) {
			shell_print(shell, "Request PER clear from 0x%08x", clear_peer_sigs[i]);
		}

		cleared = proto_send_control_with_retry(shell,
						 RADIO_PROTO_CMD_CLEAR_PER_REQ,
						 clear_peer_sigs[i],
						 0u,
						 0u,
						 wait_ms,
						 retry_ms);
		if (!cleared) {
			all_clear_done = false;
			continue;
		}

		if (proto_verbose_logging_enabled() && shell != NULL) {
			shell_print(shell,
				    "PER clear confirmed by 0x%08x",
				    clear_peer_sigs[i]);
		}
	}

	if (proto_verbose_logging_enabled() && shell != NULL) {
		if (proto_collect_per_cancel) {
			shell_print(shell, "PER collection or clear confirmation cancelled");
		} else if (!all_per_done) {
			shell_print(shell,
				   "PER collection stopped before all peers reported (round limit reached)");
		} else if (!all_clear_done) {
			shell_print(shell,
				   "PER clear confirmation stopped before all peers acknowledged (round limit reached)");
		} else {
			shell_print(shell, "All discovered peers reported PER and confirmed clear");
		}
	}

