KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	proto_collect_per_cancel = false;
	return 0;
}

static int proto_round_robin_run_internal(const struct shell *shell, uint32_t packets,
					   uint32_t wait_ms, uint32_t retry_ms)
{
	uint32_t peer_sigs[RADIO_PROTO_MAX_PEERS];
	uint32_t cycle_sigs[SHARED_TEST_LIST_MAX];
	uint8_t peer_count;
	uint8_t cycle_count;
	enum radio_node_mode prev_mode = (enum radio_node_mode)node_cfg.mode;

	peer_count = radio_proto_get_peer_signatures(peer_sigs, ARRAY_SIZE(peer_sigs));
	if (peer_count == 0) {
		shell_print(shell, "No receivers in discovered peer list. Run proto_send_discover first.");
		return 0;
	}

	cycle_count = proto_build_cycle_node_list(cycle_sigs, ARRAY_SIZE(cycle_sigs));
	shared_test_list_clear_local();
	for (uint8_t i = 0; i < cycle_count; i++) {
		(void)shared_test_list_add_local(cycle_sigs[i]);
	}
	proto_sync_shared_list_to_all_peers(shell, cycle_sigs, cycle_count, wait_ms, retry_ms);

	proto_remote_test_cancel = false;
	node_apply_mode(RADIO_NODE_MODE_COORDINATOR);

	for (uint8_t i = 0; i < peer_count; i++) {
		/* Delegate is silent while it performs discovery/PER/CLEAR phases.
		 * Scale inactivity timeout with wait/retry parameters and keep a generous floor. */
		uint32_t inactivity_timeout_ms = ((wait_ms + retry_ms) * 24u) + 5000u;
		uint32_t last_inactivity_ms = 0u;
		uint16_t synthesized_reports = 0u;
		bool timed_out = false;
		const char *ack_reason = "explicit";
		bool req_acked = false;
		uint32_t req_ack_wait_ms = wait_ms > REMOTE_TEST_REQ_ACK_WAIT_MIN_MS ?
			wait_ms : REMOTE_TEST_REQ_ACK_WAIT_MIN_MS;

		if (inactivity_timeout_ms < 60000u) {
			inactivity_timeout_ms = 60000u;
		}

		if (proto_remote_test_cancel) {
			break;
		}

		remote_test_monitor.active = true;
		remote_test_monitor.req_acked = false;
		remote_test_monitor.done = false;
		remote_test_monitor.delegate_signature = peer_sigs[i];
		remote_test_monitor.expected_packets = (uint16_t)packets;
		remote_test_monitor.reported_peers = 0u;
		remote_test_monitor.reported_peer_count = 0u;
		remote_test_monitor.last_activity_ticks = (uint32_t)k_uptime_get_32();
		memset(remote_test_monitor.reported_peer_sigs, 0, sizeof(remote_test_monitor.reported_peer_sigs));
		if (shell != NULL) {
			shell_print(shell,
				   "RR_DIAG,start,delegate=0x%08x,packets=%u,wait=%u,retry=%u,inactivity_to=%u",
				   peer_sigs[i],
				   (unsigned int)packets,
				   (unsigned int)wait_ms,
				   (unsigned int)retry_ms,
				   (unsigned int)inactivity_timeout_ms);
		}
		if (proto_verbose_logging_enabled()) {
			shell_print(shell, "Round-robin: request remote test from 0x%08x", peer_sigs[i]);
		}
		for (uint8_t attempt = 0; attempt < REMOTE_TEST_REQ_RETRY_MAX && !req_acked; attempt++) {
			uint32_t req_wait_start;

			remote_test_req_ack_received = false;
			remote_test_req_ack_packets = 0u;

			radio_proto_set_role(RADIO_PROTO_ROLE_TX);
			proto_cfg.role = RADIO_PROTO_ROLE_TX;

			if (proto_send_frame_ex(shell,
					    RADIO_PROTO_CMD_REMOTE_TEST_REQ,
					    peer_sigs[i],
					    (uint16_t)packets,
					    proto_pack_u16_pair((uint16_t)wait_ms, (uint16_t)retry_ms),
					    1u) != 0) {
				node_apply_mode(RADIO_NODE_MODE_COORDINATOR);
				continue;
			}

			node_apply_mode(RADIO_NODE_MODE_COORDINATOR);

			req_wait_start = (uint32_t)k_uptime_get_32();
			while (!proto_remote_test_cancel &&
			       !remote_test_req_ack_received &&
			       (uint32_t)(k_uptime_get_32() - req_wait_start) < req_ack_wait_ms) {
				k_msleep(20);
			}

			if (remote_test_req_ack_received &&
			    remote_test_req_ack_packets == (uint16_t)packets) {
				req_acked = true;
				remote_test_monitor.req_acked = true;
			}
		}

		if (shell != NULL) {
			shell_print(shell,
				   "RR_DIAG,req,delegate=0x%08x,acked=%u,reason=%s,ack_packets=%u",
				   peer_sigs[i],
				   req_acked ? 1u : 0u,
				   ack_reason,
				   (unsigned int)remote_test_req_ack_packets);
		}

		if (!req_acked) {
			ack_reason = "none";
			if (proto_verbose_logging_enabled()) {
				shell_print(shell,
					   "Round-robin: no REMOTE_TEST_REQ_ACK from 0x%08x after %u attempts",
					   peer_sigs[i],
					   (unsigned int)REMOTE_TEST_REQ_RETRY_MAX);
			}

			/* Keep output matrix complete even if delegate never acknowledged request. */
			for (uint8_t r = 0; r < peer_count; r++) {
				uint32_t rx_sig = peer_sigs[r];

				if (rx_sig == peer_sigs[i]) {
					continue;
				}

				if (remote_test_monitor_has_peer_report(rx_sig)) {
					continue;
				}

				proto_emit_per_timeout(rx_sig, peer_sigs[i], (uint16_t)packets);
				(void)remote_test_monitor_mark_peer_reported(rx_sig);
				remote_test_monitor.reported_peers++;
				synthesized_reports++;
			}

			if (shell != NULL) {
				shell_print(shell,
				   "RR_DIAG,end,delegate=0x%08x,done=%u,timed_out=%u,reason=%s,reports=%u,synth=%u,last_inactive=%u",
				   peer_sigs[i],
				   0u,
				   0u,
				   ack_reason,
				   (unsigned int)remote_test_monitor.reported_peers,
				   (unsigned int)synthesized_reports,
				   (unsigned int)last_inactivity_ms);
			}

			remote_test_monitor.active = false;
			remote_test_monitor.req_acked = false;
			continue;
		}

		while (!proto_remote_test_cancel && !remote_test_monitor.done) {
			uint32_t now_ticks = (uint32_t)k_uptime_get_32();
			uint32_t inactivity_ms = now_ticks - remote_test_monitor.last_activity_ticks;
			last_inactivity_ms = inactivity_ms;

			if (inactivity_ms > inactivity_timeout_ms) {
				timed_out = true;
				if (proto_verbose_logging_enabled()) {
					shell_print(shell,
						   "Round-robin: delegate 0x%08x timed out (inactive %ums)",
						   peer_sigs[i],
						   inactivity_ms);
				}
				break;
			}
			k_msleep(20);
		}

		if (proto_remote_test_cancel) {
			if (proto_verbose_logging_enabled()) {
				shell_print(shell, "Round-robin remote test cancelled");
			}
			break;
		}

		for (uint8_t r = 0; r < peer_count; r++) {
			uint32_t rx_sig = peer_sigs[r];

			if (rx_sig == peer_sigs[i]) {
				continue;
			}

			if (remote_test_monitor_has_peer_report(rx_sig)) {
				continue;
			}

			/* Keep output matrix complete even when delegate misses a peer. */
			proto_emit_per_timeout(rx_sig, peer_sigs[i], (uint16_t)packets);
			(void)remote_test_monitor_mark_peer_reported(rx_sig);
			remote_test_monitor.reported_peers++;
			synthesized_reports++;

			if (proto_verbose_logging_enabled()) {
				shell_print(shell,
					   "Round-robin: synthesized missing report tx=0x%08x rx=0x%08x",
					   peer_sigs[i],
					   rx_sig);
			}
		}

		if (proto_verbose_logging_enabled()) {
			shell_print(shell,
				"Round-robin: delegate 0x%08x complete, reports=%u",
				peer_sigs[i],
				remote_test_monitor.reported_peers);
		}
		if (shell != NULL) {
			shell_print(shell,
				   "RR_DIAG,end,delegate=0x%08x,done=%u,timed_out=%u,reason=%s,reports=%u,synth=%u,last_inactive=%u",
				   peer_sigs[i],
				   remote_test_monitor.done ? 1u : 0u,
				   timed_out ? 1u : 0u,
				   ack_reason,
				   (unsigned int)remote_test_monitor.reported_peers,
				   (unsigned int)synthesized_reports,
				   (unsigned int)last_inactivity_ms);
		}

		/* Keep acking duplicate REMOTE_TEST_DONE frames until the delegate has
		 * gone quiet for at least one retry window, so it can finish its done-retry
		 * loop and return to RX before CLEAR/TEST_START.
		 */
		{
			uint32_t done_drain_ms = MAX(retry_ms, REMOTE_TEST_DONE_DRAIN_MIN_MS);
			uint32_t quiet_start;

			do {
				quiet_start = remote_test_monitor.last_activity_ticks;
				k_msleep(done_drain_ms);
			} while ((uint32_t)(k_uptime_get_32() - remote_test_monitor.last_activity_ticks) < done_drain_ms ||
				 quiet_start != remote_test_monitor.last_activity_ticks);
		}

		remote_test_monitor.active = false;
		remote_test_monitor.req_acked = false;
		proto_clear_counters_before_test(shell, wait_ms, retry_ms);
		radio_proto_reset_local_test_counter();

		/* Allow the finished delegate time to restore RX mode before next delegate discovers. */
		if ((i + 1u) < peer_count) {
			k_msleep(wait_ms);
		}
	}

	remote_test_monitor.active = false;
	remote_test_monitor.req_acked = false;
	remote_test_monitor.done = false;
	proto_remote_test_cancel = false;
	node_apply_mode(prev_mode);
	return 0;
}

static bool remote_test_send_report_with_retry(uint32_t controller_signature,
					       uint32_t peer_signature,
					       uint16_t reported_rx_packets,
					       uint16_t retry_ms)
{
	for (uint8_t attempt = 0; attempt < REMOTE_TEST_REPORT_RETRY_MAX; attempt++) {
		remote_test_report_ack_received = false;
		remote_test_report_ack_peer = 0u;
		remote_test_report_ack_value = 0u;
		radio_proto_set_role(RADIO_PROTO_ROLE_TX);
		proto_cfg.role = RADIO_PROTO_ROLE_TX;

		if (proto_send_frame_ex(NULL,
				    RADIO_PROTO_CMD_REMOTE_TEST_REPORT,
				    controller_signature,
				    reported_rx_packets,
				    peer_signature,
				    1u) != 0) {
			continue;
		}

		k_msleep(2);

		/* While waiting for the controller ACK, behave like an RX peer so late
		 * CLEAR/TEST boundary traffic can still be answered.
		 */
		radio_proto_set_role(RADIO_PROTO_ROLE_RX);
		proto_cfg.role = RADIO_PROTO_ROLE_RX;
		proto_rx_window(retry_ms);

