KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
		if (remote_test_report_ack_received &&
		    remote_test_report_ack_peer == peer_signature &&
		    remote_test_report_ack_value == reported_rx_packets) {
			return true;
		}
	}

	return false;
}

static bool remote_test_send_done_with_retry(uint32_t controller_signature,
				     uint16_t reported_peers,
				     uint16_t retry_ms)
{
	for (uint8_t attempt = 0; attempt < REMOTE_TEST_DONE_RETRY_MAX; attempt++) {
		remote_test_done_ack_received = false;
		remote_test_done_ack_reports = 0u;
		radio_proto_set_role(RADIO_PROTO_ROLE_TX);
		proto_cfg.role = RADIO_PROTO_ROLE_TX;

		if (proto_send_frame_ex(NULL,
				    RADIO_PROTO_CMD_REMOTE_TEST_DONE,
				    controller_signature,
				    reported_peers,
				    0u,
				    1u) != 0) {
			continue;
		}

		k_msleep(2);

		/* While waiting for DONE_ACK, stay response-capable for CLEAR/TEST
		 * control traffic from the coordinator.
		 */
		radio_proto_set_role(RADIO_PROTO_ROLE_RX);
		proto_cfg.role = RADIO_PROTO_ROLE_RX;
		proto_rx_window(retry_ms);

		if (remote_test_done_ack_received &&
		    remote_test_done_ack_reports == reported_peers) {
			return true;
		}
	}

	return false;
}

static void proto_clear_counters_before_test(const struct shell *shell,
					      uint32_t wait_ms,
					      uint32_t retry_ms)
{
	uint32_t peer_sigs[RADIO_PROTO_MAX_PEERS];
	uint8_t peer_count = radio_proto_get_peer_signatures(peer_sigs, ARRAY_SIZE(peer_sigs));

	if (peer_count == 0u) {
		return;
	}

	radio_proto_reset_clear_per_results();
	radio_proto_set_role(RADIO_PROTO_ROLE_TX);
	proto_cfg.role = RADIO_PROTO_ROLE_TX;

	for (uint8_t i = 0; i < peer_count; i++) {
		bool cleared = proto_send_control_with_retry(shell,
						     RADIO_PROTO_CMD_CLEAR_PER_REQ,
						     peer_sigs[i],
						     0u,
						     0u,
						     wait_ms,
						     retry_ms);

		if (!cleared && proto_verbose_logging_enabled()) {
			if (shell != NULL) {
				shell_print(shell,
					   "Pre-test clear not confirmed for 0x%08x",
					   peer_sigs[i]);
			} else {
				printk("Pre-test clear not confirmed for 0x%08x\n", peer_sigs[i]);
			}
		}
	}
}

static void remote_test_work_handler(struct k_work *work)
{
	enum radio_node_mode prev_mode;
	struct remote_test_request_state request;
	struct radio_proto_status status;
	uint32_t peer_sigs[RADIO_PROTO_MAX_PEERS];
	uint8_t peer_count;
	uint16_t reported_peers = 0u;

	ARG_UNUSED(work);

	if (!remote_test_request.pending) {
		return;
	}

	request = remote_test_request;
	remote_test_request.pending = false;
	remote_test_request.busy = true;
	remote_test_report_ack_received = false;
	remote_test_report_ack_peer = 0u;
	remote_test_report_ack_value = 0u;
	remote_test_done_ack_received = false;
	remote_test_done_ack_reports = 0u;
	proto_remote_test_cancel = false;
	prev_mode = (enum radio_node_mode)node_cfg.mode;

	if (proto_verbose_logging_enabled()) {
		printk("Remote test start: controller=0x%08x packets=%u wait=%u retry=%u\n",
		       request.controller_signature,
		       request.packets,
		       request.wait_ms,
		       request.retry_ms);
	}
	printk("RTW_DIAG,start,controller=0x%08x,packets=%u,wait=%u,retry=%u\n",
	       request.controller_signature,
	       request.packets,
	       request.wait_ms,
	       request.retry_ms);

	node_apply_mode(RADIO_NODE_MODE_TEST_TX);
	radio_proto_reset();
	radio_proto_set_signature(proto_cfg.signature);
	radio_proto_set_role(RADIO_PROTO_ROLE_TX);
	proto_cfg.role = RADIO_PROTO_ROLE_TX;

	peer_count = shared_test_list_copy(peer_sigs, ARRAY_SIZE(peer_sigs));
	if (proto_verbose_logging_enabled()) {
		printk("Remote test shared list ready: %u nodes\n", peer_count);
	}
	printk("RTW_DIAG,discover,controller=0x%08x,peers=%u\n",
	       request.controller_signature,
	       peer_count);

	proto_send_test_boundary_to_targets(NULL,
				      RADIO_PROTO_CMD_TEST_START,
				      proto_cfg.signature,
				      peer_sigs,
				      peer_count,
				      request.wait_ms,
				      request.retry_ms);
	k_msleep(TEST_START_SETTLE_MS);

	if (peer_count > 0u && request.packets > 0u) {
		if (proto_send_frame_ex(NULL,
				    RADIO_PROTO_CMD_TEST_DATA,
				    RADIO_PROTO_BROADCAST_SIG,
				    request.packets,
				    0u,
				    request.packets) == 0) {
			k_msleep(request.wait_ms);
		}

		proto_send_test_boundary_to_targets(NULL,
					      RADIO_PROTO_CMD_TEST_END,
					      proto_cfg.signature,
					      peer_sigs,
					      peer_count,
					      request.wait_ms,
					      request.retry_ms);

		radio_proto_reset_per_results();
		for (uint8_t i = 0; i < peer_count; i++) {
			uint16_t reported_rx_packets = 0u;
			bool got_rsp = false;

			if (peer_sigs[i] == proto_cfg.signature) {
				continue;
			}

			for (uint8_t attempt = 0; attempt < PROTO_PER_PHASE_MAX_ROUNDS && !got_rsp; attempt++) {
				radio_proto_set_role(RADIO_PROTO_ROLE_TX);
				proto_cfg.role = RADIO_PROTO_ROLE_TX;

				if (proto_send_frame_ex(NULL,
						    RADIO_PROTO_CMD_PER_REQ,
						    peer_sigs[i],
						    request.packets,
						    0u,
						    1u) != 0) {
					continue;
				}

				k_msleep(2);
				proto_rx_window(request.wait_ms);
				radio_proto_get_status(&status);

				for (uint8_t p = 0; p < status.peer_count; p++) {
					if (status.peers[p].signature == peer_sigs[i] &&
					    status.peers[p].seen_per_rsp) {
						reported_rx_packets = status.peers[p].reported_rx_packets;
						got_rsp = true;
						break;
					}
				}

				if (!got_rsp) {
					k_msleep(request.retry_ms);
				}
			}

			if (!got_rsp) {
				if (proto_verbose_logging_enabled()) {
					printk("Remote test PER response missing: peer=0x%08x expected=%u\n",
					       peer_sigs[i],
					       request.packets);
				}
				printk("RTW_DIAG,per_rsp_timeout,controller=0x%08x,peer=0x%08x,expected=%u\n",
				       request.controller_signature,
				       peer_sigs[i],
				       request.packets);
				continue;
			}

			if (remote_test_send_report_with_retry(request.controller_signature,
					      peer_sigs[i],
					      reported_rx_packets,
					      request.retry_ms)) {
				reported_peers++;
				printk("RTW_DIAG,report,controller=0x%08x,peer=0x%08x,rx=%u,ok=1\n",
				       request.controller_signature,
				       peer_sigs[i],
				       reported_rx_packets);
			} else {
				if (proto_verbose_logging_enabled()) {
					printk("Remote test report delivery failed: peer=0x%08x rx=%u\n",
					       peer_sigs[i],
					       reported_rx_packets);
				}
				printk("RTW_DIAG,report,controller=0x%08x,peer=0x%08x,rx=%u,ok=0\n",
				       request.controller_signature,
				       peer_sigs[i],
				       reported_rx_packets);
			}
		}
	}

	if (!remote_test_send_done_with_retry(request.controller_signature,
				      reported_peers,
				      request.retry_ms)) {
		if (proto_verbose_logging_enabled()) {
			printk("Remote test done delivery failed: reports=%u\n", reported_peers);
		}
		printk("RTW_DIAG,done,controller=0x%08x,reports=%u,ok=0\n",
		       request.controller_signature,
		       reported_peers);
	} else {
		printk("RTW_DIAG,done,controller=0x%08x,reports=%u,ok=1\n",
		       request.controller_signature,
		       reported_peers);
	}

	radio_proto_reset();
	radio_proto_reset_local_test_counter();
	node_apply_mode(prev_mode);
	remote_test_request.busy = false;
	proto_remote_test_cancel = false;
}

static int cmd_proto_collect_per(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t expected = proto_cfg.test_packets;
	uint32_t wait_ms = proto_cfg.per_wait_ms;
	uint32_t retry_ms = proto_cfg.per_wait_ms;

