KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	if (argc < 2 || argc > 4) {
		shell_error(shell, "Usage: proto_collect_per <expected_packets> [wait_ms] [retry_ms]");
		return -EINVAL;
	}

	expected = strtoul(argv[1], NULL, 0);
	if (argc >= 3) {
		wait_ms = strtoul(argv[2], NULL, 0);
	}
	if (argc == 4) {
		retry_ms = strtoul(argv[3], NULL, 0);
	}

	return proto_collect_per_run(shell, expected, wait_ms, retry_ms);
}

static int cmd_proto_tx_run(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t packets = proto_cfg.test_packets;
	uint32_t per_wait_ms = proto_cfg.per_wait_ms;
	uint32_t retry_ms = proto_cfg.per_wait_ms;
	uint32_t peer_sigs[RADIO_PROTO_MAX_PEERS];
	uint8_t peer_count;

	if (argc > 4) {
		shell_error(shell, "Usage: proto_tx_run [packets] [per_wait_ms] [retry_ms]");
		return -EINVAL;
	}

	if (!proto_require_ieee_mode(shell)) {
		return -EINVAL;
	}

	if (argc >= 2) {
		packets = strtoul(argv[1], NULL, 0);
	}
	if (argc >= 3) {
		per_wait_ms = strtoul(argv[2], NULL, 0);
	}
	if (argc == 4) {
		retry_ms = strtoul(argv[3], NULL, 0);
	}

	if (packets == 0 || packets > UINT16_MAX) {
		shell_error(shell, "packets must be in range 1..65535");
		return -EINVAL;
	}

	proto_cfg.test_packets = packets;
	proto_cfg.per_wait_ms = per_wait_ms;

	radio_proto_set_role(RADIO_PROTO_ROLE_TX);

	peer_count = radio_proto_get_peer_signatures(peer_sigs, ARRAY_SIZE(peer_sigs));
	shell_print(shell, "TX run: using %u discovered peers", peer_count);

	if (peer_count == 0) {
		shell_print(shell, "No receivers in discovered peer list. Run proto_send_discover first.");
		return 0;
	}

	shell_print(shell, "TX run: sending %u TEST_DATA packets", packets);
	if (proto_send_frame(shell,
		    RADIO_PROTO_CMD_TEST_DATA,
		    0xFFFFFFFFu,
		    (uint16_t)packets,
		    packets) != 0) {
		return -EIO;
	}

	/* Wait for the last TEST_DATA packet to propagate before requesting PER. */
	k_msleep(per_wait_ms);

	(void)proto_collect_per_run(shell, packets, per_wait_ms, retry_ms);

	cmd_proto_status(shell, 0, NULL);
	return 0;
}

static int cmd_proto_round_robin_run(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t packets = proto_cfg.test_packets;
	uint32_t wait_ms = proto_cfg.per_wait_ms;
	uint32_t retry_ms = proto_cfg.per_wait_ms;

	if (argc > 4) {
		shell_error(shell, "Usage: proto_round_robin_run [packets] [wait_ms] [retry_ms]");
		return -EINVAL;
	}

	if (!proto_require_ieee_mode(shell)) {
		return -EINVAL;
	}

	if (argc >= 2) {
		packets = strtoul(argv[1], NULL, 0);
	}
	if (argc >= 3) {
		wait_ms = strtoul(argv[2], NULL, 0);
	}
	if (argc == 4) {
		retry_ms = strtoul(argv[3], NULL, 0);
	}

	if (packets == 0 || packets > UINT16_MAX || wait_ms > UINT16_MAX || retry_ms > UINT16_MAX) {
		shell_error(shell, "packets must be 1..65535 and wait/retry must be <= 65535");
		return -EINVAL;
	}

	return proto_round_robin_run_internal(shell, packets, wait_ms, retry_ms);
}

static int cmd_proto_test_run(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t packets = proto_cfg.test_packets;
	uint32_t wait_ms = proto_cfg.per_wait_ms;
	uint32_t retry_ms = proto_cfg.per_wait_ms;
	uint32_t cycle_sigs[SHARED_TEST_LIST_MAX];
	uint8_t cycle_count;
	int err;

	proto_ack_start(shell, "proto_test_run");

	if (argc > 4) {
		shell_error(shell, "Usage: proto_test_run [packets] [wait_ms] [retry_ms]");
		err = -EINVAL;
		goto out;
	}

	if (!proto_require_ieee_mode(shell)) {
		err = -EINVAL;
		goto out;
	}

	if (argc >= 2) {
		packets = strtoul(argv[1], NULL, 0);
	}
	if (argc >= 3) {
		wait_ms = strtoul(argv[2], NULL, 0);
	}
	if (argc == 4) {
		retry_ms = strtoul(argv[3], NULL, 0);
	}

	if (packets == 0 || packets > UINT16_MAX || wait_ms > UINT16_MAX || retry_ms > UINT16_MAX) {
		shell_error(shell, "packets must be 1..65535 and wait/retry must be <= 65535");
		err = -EINVAL;
		goto out;
	}

	/* Keep existing local TX behavior, then run delegated round-robin in one command. */
	proto_cfg.test_packets = packets;
	proto_cfg.per_wait_ms = wait_ms;
	cycle_count = proto_build_cycle_node_list(cycle_sigs, ARRAY_SIZE(cycle_sigs));
	if (cycle_count == 0u) {
		err = 0;
		goto out;
	}

	shared_test_list_clear_local();
	for (uint8_t i = 0; i < cycle_count; i++) {
		(void)shared_test_list_add_local(cycle_sigs[i]);
	}
	/* Note: shared-list sync to remote nodes is deferred to the round-robin
	 * delegation phase where each remote broadcaster needs the full peer
	 * list.  Syncing here before the coordinator's own TX cycle is
	 * unnecessary and roughly doubles pre-test setup time.
	 */

	radio_proto_set_role(RADIO_PROTO_ROLE_TX);
	proto_cfg.role = RADIO_PROTO_ROLE_TX;
	proto_clear_counters_before_test(shell, wait_ms, retry_ms);
	proto_send_test_boundary_to_targets(shell,
				      RADIO_PROTO_CMD_TEST_START,
				      proto_cfg.signature,
				      cycle_sigs,
				      cycle_count,
				      wait_ms,
				      retry_ms);
	k_msleep(TEST_START_SETTLE_MS);

	if (proto_send_frame(shell,
		    RADIO_PROTO_CMD_TEST_DATA,
		    0xFFFFFFFFu,
		    (uint16_t)packets,
		    packets) != 0) {
		err = -EIO;
		goto out;
	}

	k_msleep(wait_ms);
	proto_send_test_boundary_to_targets(shell,
				      RADIO_PROTO_CMD_TEST_END,
				      proto_cfg.signature,
				      cycle_sigs,
				      cycle_count,
				      wait_ms,
				      retry_ms);
	(void)proto_collect_per_run(shell, packets, wait_ms, retry_ms);
	radio_proto_reset_local_test_counter();
	err = proto_round_robin_run_internal(shell, packets, wait_ms, retry_ms);

out:
	proto_ack_end(shell, "proto_test_run", err);
	return err;
}

static const char *node_mode_str(enum radio_node_mode mode)
{
	switch (mode) {
	case RADIO_NODE_MODE_COORDINATOR:
		return "coordinator";
	case RADIO_NODE_MODE_RECEIVER:
		return "receiver";
	case RADIO_NODE_MODE_TEST_TX:
		return "test_tx";
	case RADIO_NODE_MODE_UNASSIGNED:
	default:
		return "unassigned";
	}
}

static int cmd_node_mode(const struct shell *shell, size_t argc, char **argv)
{
	enum radio_node_mode mode;
	int err = 0;

	proto_ack_start(shell, "node_mode");

	if (argc != 2) {
		shell_error(shell,
			    "Usage: node_mode <unassigned|coordinator|receiver|test_tx> (set X/Y with node_type)");
		err = -EINVAL;
		goto out;
	}

	if (strcmp(argv[1], "unassigned") == 0) {
		mode = RADIO_NODE_MODE_UNASSIGNED;
		node_cfg.assigned_signature = 0u;
	} else if (strcmp(argv[1], "coordinator") == 0) {
		mode = RADIO_NODE_MODE_COORDINATOR;
	} else if (strcmp(argv[1], "receiver") == 0) {
		if (node_cfg.assigned_signature == 0u) {
			shell_error(shell, "No assigned receiver ID stored yet");
			err = -EINVAL;
			goto out;
		}
		mode = RADIO_NODE_MODE_RECEIVER;
	} else if (strcmp(argv[1], "test_tx") == 0) {
		mode = RADIO_NODE_MODE_TEST_TX;
	} else {
		shell_error(shell, "Invalid node mode: %s", argv[1]);
		err = -EINVAL;
		goto out;
	}

	node_apply_mode(mode);
	k_work_reschedule(&node_settings_save_work, K_NO_WAIT);
	if (proto_verbose_logging_enabled()) {
		shell_print(shell, "Node mode set to %s", node_mode_str(mode));
	}

out:
	proto_ack_end(shell, "node_mode", err);
	return err;
}

static int cmd_node_type(const struct shell *shell, size_t argc, char **argv)
{
	int err = 0;

	proto_ack_start(shell, "node_type");

	if (argc != 2) {
		shell_error(shell, "Usage: node_type <x|y>");
		err = -EINVAL;
		goto out;
	}

