KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	if (strcmp(argv[1], "x") == 0 || strcmp(argv[1], "X") == 0) {
		node_cfg.node_type = RADIO_SURVEY_NODE_TYPE_X;
	} else if (strcmp(argv[1], "y") == 0 || strcmp(argv[1], "Y") == 0) {
		node_cfg.node_type = RADIO_SURVEY_NODE_TYPE_Y;
	} else {
		shell_error(shell, "Invalid node type: %s", argv[1]);
		err = -EINVAL;
		goto out;
	}

	node_apply_local_profile_to_proto();
	k_work_reschedule(&node_settings_save_work, K_NO_WAIT);
	shell_print(shell, "Node type set to %s", node_type_str(node_cfg.node_type));

out:
	proto_ack_end(shell, "node_type", err);
	return err;
}

static int cmd_node_aggregator(const struct shell *shell, size_t argc, char **argv)
{
	int err = 0;

	proto_ack_start(shell, "node_aggregator");

	if (argc != 2) {
		shell_error(shell, "Usage: node_aggregator <on|off>");
		err = -EINVAL;
		goto out;
	}

	if (strcmp(argv[1], "on") == 0 || strcmp(argv[1], "1") == 0) {
		node_cfg.is_data_aggregator = 1u;
	} else if (strcmp(argv[1], "off") == 0 || strcmp(argv[1], "0") == 0) {
		node_cfg.is_data_aggregator = 0u;
	} else {
		shell_error(shell, "Invalid aggregator state: %s", argv[1]);
		err = -EINVAL;
		goto out;
	}

	node_apply_local_profile_to_proto();
	k_work_reschedule(&node_settings_save_work, K_NO_WAIT);
	shell_print(shell,
		   "Data aggregator role %s",
		   node_cfg.is_data_aggregator ? "enabled" : "disabled");

out:
	proto_ack_end(shell, "node_aggregator", err);
	return err;
}

static int cmd_log_mode(const struct shell *shell, size_t argc, char **argv)
{
	int err = 0;

	proto_ack_start(shell, "log_mode");

	if (argc != 2) {
		shell_error(shell, "Usage: log_mode <minimal|verbose>");
		err = -EINVAL;
		goto out;
	}

	if (strcmp(argv[1], "minimal") == 0) {
		proto_minimal_logging = true;
	} else if (strcmp(argv[1], "verbose") == 0) {
		proto_minimal_logging = false;
	} else {
		shell_error(shell, "Invalid log mode: %s", argv[1]);
		err = -EINVAL;
		goto out;
	}

	shell_print(shell, "LOG_MODE,%s", proto_minimal_logging ? "minimal" : "verbose");

out:
	proto_ack_end(shell, "log_mode", err);
	return err;
}

static int cmd_node_status(const struct shell *shell, size_t argc, char **argv)
{
	shell_print(shell,
		"node mode=%s type=%s aggregator=%u hw_sig=0x%08x active_sig=0x%08x assigned_sig=0x%08x next_rx_id=%u",
		node_mode_str((enum radio_node_mode)node_cfg.mode),
		node_type_str(node_cfg.node_type),
		node_cfg.is_data_aggregator ? 1u : 0u,
		node_hw_signature,
		proto_cfg.signature,
		node_cfg.assigned_signature,
		(unsigned int)node_cfg.next_receiver_id);
	return 0;
}

static int cmd_node_factory_reset(const struct shell *shell, size_t argc, char **argv)
{
	node_cfg.assigned_signature = 0u;
	node_cfg.next_receiver_id = 1u;
	radio_proto_reset();
	node_apply_mode(RADIO_NODE_MODE_UNASSIGNED);
	k_work_reschedule(&node_settings_save_work, K_NO_WAIT);
	shell_print(shell, "Node settings cleared");
	return 0;
}

#if CONFIG_FEM
static int cmd_fem(const struct shell *shell, size_t argc, char **argv)
{
	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count.", argv[0]);
		return -EINVAL;
	}

	if (argc == 2) {
		shell_error(shell, "Unknown argument: %s.", argv[1]);
		return -EINVAL;
	}

	return 0;
}

#if !CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC
static int cmd_fem_tx_power_control_set(const struct shell *shell, size_t argc,
			    char **argv)
{
	uint32_t tx_power_control;

	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count", argv[0]);
		return -EINVAL;
	}

	tx_power_control = atoi(argv[1]);

	config.fem.tx_power_control = tx_power_control;

	shell_print(shell, "Front-end module (FEM) Tx power control set to %u", tx_power_control);

	return 0;
}
#endif /* !CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC */

static int cmd_fem_antenna_select(const struct shell *shell, size_t argc,
				  char **argv)
{
	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count.", argv[0]);
		return -EINVAL;
	}

	if (argc == 2) {
		shell_error(shell, "Unknown argument: %s.", argv[1]);
		return -EINVAL;
	}

	return 0;
}

static int cmd_fem_antenna_1(const struct shell *shell, size_t argc,
			     char **argv)
{
	shell_print(shell, "ANT1 enabled, ANT2 disabled");

	return fem_antenna_select(FEM_ANTENNA_1);
}

static int cmd_fem_antenna_2(const struct shell *shell, size_t argc,
			     char **argv)
{
	shell_print(shell, "ANT1 disabled, ANT2 enabled");

	return fem_antenna_select(FEM_ANTENNA_2);
}

static int cmd_fem_ramp_up_set(const struct shell *shell, size_t argc, char **argv)
{
	uint32_t ramp_up_time;

	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count", argv[0]);
		return -EINVAL;
	}

	ramp_up_time = atoi(argv[1]);

	config.fem.ramp_up_time = ramp_up_time;

	shell_print(shell, "Front-end module (FEM) radio rump-up time set to %d us", ramp_up_time);

	return 0;
}
#endif /* CONFIG_FEM */

SHELL_STATIC_SUBCMD_SET_CREATE(sub_output_power,
#if defined(RADIO_TXPOWER_TXPOWER_Pos10dBm)
	SHELL_CMD(pos10dBm, NULL, "TX power: +10 dBm", cmd_pos10dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos10dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos9dBm)
	SHELL_CMD(pos9dBm, NULL, "TX power: +9 dBm", cmd_pos9dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos9dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos8dBm)
	SHELL_CMD(pos8dBm, NULL, "TX power: +8 dBm", cmd_pos8dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos8dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos7dBm)
	SHELL_CMD(pos7dBm, NULL, "TX power: +7 dBm", cmd_pos7dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos7dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos6dBm)
	SHELL_CMD(pos6dBm, NULL, "TX power: +6 dBm", cmd_pos6dbm),
#endif/* defined(RADIO_TXPOWER_TXPOWER_Pos6dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos5dBm)
	SHELL_CMD(pos5dBm, NULL, "TX power: +5 dBm", cmd_pos5dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos5dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos4dBm)
	SHELL_CMD(pos4dBm, NULL, "TX power: +4 dBm", cmd_pos4dbm),
#endif /* RADIO_TXPOWER_TXPOWER_Pos4dBm */
#if defined(RADIO_TXPOWER_TXPOWER_Pos3dBm)
	SHELL_CMD(pos3dBm, NULL, "TX power: +3 dBm", cmd_pos3dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos3dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos2dBm)
	SHELL_CMD(pos2dBm, NULL, "TX power: +2 dBm", cmd_pos2dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos2dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos1dBm)
	SHELL_CMD(pos1dBm, NULL, "TX power: +1 dBm", cmd_pos1dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos1dBm) */
	SHELL_CMD(pos0dBm, NULL, "TX power: 0 dBm", cmd_pos0dbm),
#if defined(RADIO_TXPOWER_TXPOWER_Neg1dBm)
	SHELL_CMD(neg1dBm, NULL, "TX power: -1 dBm", cmd_neg1dbm),
#endif /* RADIO_TXPOWER_TXPOWER_Neg1dBm */
#if defined(RADIO_TXPOWER_TXPOWER_Neg2dBm)
	SHELL_CMD(neg2dBm, NULL, "TX power: -2 dBm", cmd_neg2dbm),
#endif /* RADIO_TXPOWER_TXPOWER_Neg2dBm */
#if defined(RADIO_TXPOWER_TXPOWER_Neg3dBm)
	SHELL_CMD(neg3dBm, NULL, "TX power: -3 dBm", cmd_neg3dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg3dBm) */
	SHELL_CMD(neg4dBm, NULL, "TX power: -4 dBm", cmd_neg4dbm),
#if defined(RADIO_TXPOWER_TXPOWER_Neg5dBm)
	SHELL_CMD(neg5dBm, NULL, "TX power: -5 dBm", cmd_neg5dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg5dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg6dBm)
	SHELL_CMD(neg6dBm, NULL, "TX power: -6 dBm", cmd_neg6dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg6dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg7dBm)
	SHELL_CMD(neg7dBm, NULL, "TX power: -7 dBm", cmd_neg7dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg7dBm) */
	SHELL_CMD(neg8dBm, NULL, "TX power: -8 dBm", cmd_neg8dbm),
#if defined(RADIO_TXPOWER_TXPOWER_Neg9dBm)
	SHELL_CMD(neg9dBm, NULL, "TX power: -9 dBm", cmd_neg9dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg9dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg10dBm)
	SHELL_CMD(neg10dBm, NULL, "TX power: -10 dBm", cmd_neg10dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg10dBm) */
	SHELL_CMD(neg12dBm, NULL, "TX power: -12 dBm", cmd_neg12dbm),
#if defined(RADIO_TXPOWER_TXPOWER_Neg14dBm)
	SHELL_CMD(neg14dBm, NULL, "TX power: -14 dBm", cmd_neg14dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg14dBm) */
	SHELL_CMD(neg16dBm, NULL, "TX power: -16 dBm", cmd_neg16dbm),
#if defined(RADIO_TXPOWER_TXPOWER_Neg18dBm)
	SHELL_CMD(neg18dBm, NULL, "TX power: -18 dBm", cmd_neg18dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg18dBm) */
	SHELL_CMD(neg20dBm, NULL, "TX power: -20 dBm", cmd_neg20dbm),
#if defined(RADIO_TXPOWER_TXPOWER_Neg22dBm)
	SHELL_CMD(neg22dBm, NULL, "TX power: -22 dBm", cmd_neg22dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg22dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg28dBm)
	SHELL_CMD(neg28dBm, NULL, "TX power: -28 dBm", cmd_neg28dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg28dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg30dBm)
	SHELL_CMD(neg30dBm, NULL, "TX power: -30 dBm", cmd_neg30dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg30dBm) */
	SHELL_CMD(neg40dBm, NULL, "TX power: -40 dBm", cmd_neg40dbm),
#if defined(RADIO_TXPOWER_TXPOWER_Neg46dBm)
	SHELL_CMD(neg46dBm, NULL, "TX power: -46 dBm", cmd_neg46dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg46dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg70dBm)
	SHELL_CMD(neg70dBm, NULL, "TX power: -70 dBm", cmd_neg70dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg70dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg100dBm)
	SHELL_CMD(neg100dBm, NULL, "TX power: -100 dBm", cmd_neg100dbm),
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg100dBm) */
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(sub_transmit_pattern,
	SHELL_CMD(pattern_random, NULL,
		  "Set the transmission pattern to random.",
		  cmd_pattern_random),
	SHELL_CMD(pattern_11110000, NULL,
		  "Set the transmission pattern to 11110000.",
		  cmd_pattern_11110000),
	SHELL_CMD(pattern_11001100, NULL,
		  "Set the transmission pattern to 11001100.",
		  cmd_pattern_11001100),
	SHELL_SUBCMD_SET_END
);

#if CONFIG_FEM
SHELL_STATIC_SUBCMD_SET_CREATE(sub_fem_antenna,
	SHELL_CMD(ant_1, NULL,
		  "ANT1 enabled, ANT2 disabled.",
		  cmd_fem_antenna_1),
	SHELL_CMD(ant_2, NULL,
		  "ANT1 disabled, ANT2 enabled",
		  cmd_fem_antenna_2),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(sub_fem,
#if !CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC
	SHELL_CMD(tx_power_control, NULL,
		  "Set the front-end module (FEM) Tx power control specific to the FEM in use <tx_power_control>.",
		  cmd_fem_tx_power_control_set),
#endif /* !CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC */
	SHELL_CMD(antenna, &sub_fem_antenna,
		  "Select the front-end module (FEM) antenna <sub_cmd>",
		  cmd_fem_antenna_select),
	SHELL_CMD(ramp_up_time, NULL,
		  "Set the front-end module (FEM) radio ramp-up time <time us>",
		  cmd_fem_ramp_up_set),
	SHELL_SUBCMD_SET_END
);
#endif /* CONFIG_FEM */

#if CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC
static int cmd_total_output_power_set(const struct shell *shell, size_t argc, char **argv)
{
	int power;

	if (argc == 1) {
		shell_help(shell);
		return SHELL_CMD_HELP_PRINTED;
	}

	if (argc > 2) {
		shell_error(shell, "%s: bad parameters count", argv[0]);
		return -EINVAL;
	}

