KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_cmd.c
	power = atoi(argv[1]);

	if ((power > INT8_MAX) || (power < INT8_MIN)) {
		shell_error(shell, "%s: Out of range power value", argv[0]);
		return -EINVAL;
	}

	set_config_txpower((int8_t)((int8_t)power));

	return 0;
}
#endif /* CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC */

SHELL_CMD_REGISTER(start_channel, NULL,
		   "Start channel for the sweep or the channel for"
		   " the constant carrier (in MHz as difference from 2400 MHz) <channel>",
		    cmd_start_channel_set);
SHELL_CMD_REGISTER(end_channel, NULL,
		   "End channel for the sweep (in MHz as difference from 2400 MHz) <channel>",
		   cmd_end_channel_set);
SHELL_CMD_REGISTER(time_on_channel, NULL,
		   "Time on each channel in ms (between 1 and 99) <time>",
		   cmd_time_set);
SHELL_CMD_REGISTER(cancel, NULL, "Cancel the sweep or the carrier",
		   cmd_cancel);
SHELL_CMD_REGISTER(data_rate, &sub_data_rate, "Set data rate <sub_cmd>",
		   cmd_data_rate_set);
SHELL_CMD_REGISTER(start_tx_carrier, NULL, "Start the TX carrier",
		   cmd_tx_carrier_start);
SHELL_CMD_REGISTER(start_tx_modulated_carrier, NULL,
		   "Start the modulated TX carrier",
		   cmd_tx_modulated_carrier_start);
SHELL_CMD_REGISTER(output_power,
		   &sub_output_power,
		   "Output power set <sub_cmd>"
		   "If front-end module is attached and automatic power control is enabled, "
		   "this commands sets the total output power including fem gain",
		   cmd_output_power_set);

#if CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC
SHELL_CMD_REGISTER(total_output_power, NULL,
		  "Total output power in dBm, including gain of the attached front-end module. "
		  "<tx power> dBm",
		  cmd_total_output_power_set);
#endif /* CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC */

SHELL_CMD_REGISTER(transmit_pattern,
		   &sub_transmit_pattern,
		   "Set the transmission pattern",
		   cmd_transmit_pattern_set);
SHELL_CMD_REGISTER(start_duty_cycle_modulated_tx, NULL,
		   "Duty cycle in percent (two decimal digits, between 01 and "
		   "90) <duty_cycle>", cmd_duty_cycle_set);
SHELL_CMD_REGISTER(parameters_print, NULL,
		   "Print current delay, channel and so on",
		   cmd_print);
SHELL_CMD_REGISTER(start_rx_sweep, NULL, "Start RX sweep", cmd_rx_sweep_start);
SHELL_CMD_REGISTER(start_tx_sweep, NULL, "Start TX sweep", cmd_tx_sweep_start);
SHELL_CMD_REGISTER(start_rx, NULL, "Start RX", cmd_rx_start);
SHELL_CMD_REGISTER(print_rx, NULL, "Print RX payload", cmd_print_payload);
SHELL_CMD_REGISTER(rssi_monitor, NULL,
		   "Start ambient RSSI monitor [interval_ms] or stop",
		   cmd_rssi_monitor);
SHELL_CMD_REGISTER(node_mode, NULL,
		   "Set node mode <unassigned|coordinator|receiver|test_tx>",
		   cmd_node_mode);
SHELL_CMD_REGISTER(node_type, NULL,
		   "Set site-survey node type <x|y>",
		   cmd_node_type);
SHELL_CMD_REGISTER(node_aggregator, NULL,
		   "Enable or disable data aggregator role <on|off>",
		   cmd_node_aggregator);
SHELL_CMD_REGISTER(node_status, NULL,
		   "Print persisted node state and signatures",
		   cmd_node_status);
SHELL_CMD_REGISTER(node_factory_reset, NULL,
		   "Clear assigned receiver ID and reset node state",
		   cmd_node_factory_reset);
SHELL_CMD_REGISTER(log_mode, NULL,
		   "Set runtime log mode <minimal|verbose>",
		   cmd_log_mode);
SHELL_CMD_REGISTER(proto_signature, NULL,
		   "Set local protocol signature <u32>",
		   cmd_proto_signature_set);
SHELL_CMD_REGISTER(proto_role, NULL,
		   "Set protocol role <disabled|tx|rx>",
		   cmd_proto_role_set);
SHELL_CMD_REGISTER(proto_reset, NULL,
		   "Reset protocol counters and discovered peers",
		   cmd_proto_reset);
SHELL_CMD_REGISTER(proto_status, NULL,
		   "Print protocol counters and peers",
		   cmd_proto_status);
SHELL_CMD_REGISTER(proto_rx_start, NULL,
		   "Start protocol receiver loop",
		   cmd_proto_rx_start);
SHELL_CMD_REGISTER(proto_send_discover, NULL,
		   "Send DISCOVER_REQ broadcast and listen for responses [wait_ms]",
		   cmd_proto_send_discover);
SHELL_CMD_REGISTER(discover_list_clear, NULL,
		   "Clear the persisted discovered peer list",
		   cmd_discover_list_clear);
SHELL_CMD_REGISTER(discover_status, NULL,
		   "Print discovered peer list in CSV-friendly format",
		   cmd_discover_status);
SHELL_CMD_REGISTER(proto_set_channel, NULL,
		   "Set channel on all discovered peers <channel> [wait_ms] [retry_ms]",
		   cmd_proto_set_channel);
SHELL_CMD_REGISTER(proto_send_test_data, NULL,
		   "Send TEST_DATA packets [packets]",
		   cmd_proto_send_test_data);
SHELL_CMD_REGISTER(proto_send_per_req, NULL,
		   "Send PER_REQ <dst_sig> <expected_packets> [wait_ms]",
		   cmd_proto_send_per_req);
SHELL_CMD_REGISTER(proto_collect_per, NULL,
		   "Request PER from discovered peers until all respond or cancel <expected_packets> [wait_ms] [retry_ms]",
		   cmd_proto_collect_per);
SHELL_CMD_REGISTER(proto_tx_run, NULL,
		   "Run TEST_DATA plus PER collection using the current discovered list [packets] [per_wait_ms] [retry_ms]",
		   cmd_proto_tx_run);
SHELL_CMD_REGISTER(proto_round_robin_run, NULL,
		   "Have each discovered peer run TEST_DATA/PER and report the results back here [packets] [wait_ms] [retry_ms]",
		   cmd_proto_round_robin_run);
SHELL_CMD_REGISTER(proto_test_run, NULL,
		   "Run local TEST_DATA/PER then delegated round-robin in one command [packets] [wait_ms] [retry_ms]",
		   cmd_proto_test_run);
#if defined(TOGGLE_DCDC_HELP)
SHELL_CMD_REGISTER(toggle_dcdc_state, NULL, TOGGLE_DCDC_HELP, cmd_toggle_dc);
#endif
#if CONFIG_FEM
SHELL_CMD_REGISTER(fem,
		   &sub_fem,
		   "Set the front-end module (FEM) parameters <sub_cmd>",
		   cmd_fem);
#endif /* CONFIG_FEM */

static int radio_cmd_init(void)
{
	int err;

#if CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC
	/* When front-end module is used, set output power to the front-end module
	 * default output power.
	 */
	set_config_txpower((int8_t)(fem_default_tx_output_power_get()));
#endif /* CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC */

	err = radio_test_init(&test_config);
	if (err) {
		return err;
	}

	err = settings_subsys_init();
	if (err != 0) {
		printk("settings_subsys_init failed: %d\n", err);
		return err;
	}

	err = settings_load_subtree(RADIO_NODE_SETTINGS_NAME);
	if (err != 0) {
		printk("settings_load_subtree failed: %d\n", err);
		return err;
	}

	err = radio_node_init();
	if (err != 0) {
		return err;
	}

	return 0;
}

SYS_INIT(radio_cmd_init, APPLICATION, CONFIG_KERNEL_INIT_PRIORITY_DEVICE);
